cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
* Copyright (c) 2013 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_riic_rx.c
 * Description  : Functions for using RIIC on RX devices. 
 **********************************************************************************************************************/
/**********************************************************************************************************************
 * History      : DD.MM.YYYY Version  Description
 *              : 01.07.2013 1.00     First Release
 *              : 30.09.2013 1.10     Change symbol of return value and status
 *              : 08.10.2013 1.20     Modified processing for the I/O register initialization and mode transition 
 *                                     when a stop condition is detected while the slave is communicating.
 *                                    Modified processing for mode transition when an API function is called
 *                                     while the bus is busy.
 *                                    Modified processing for mode transition
 *                                     when an arbitration lost occurred and the addresses do not match.
 *                                    Modified incorrect slave transmission after the master reception.
 *                                    Modified processing for the I/O register initialization
 *                                     when generating a start condition and receiving the slave address.
 *              : 17.07.2014 1.30     Added the processes for the timeout detection.
 *                                    Added the call back function for the timeout detection.
 *                                    The number of channels varies depending on the MCU.
 *                                    Therefore, process for each channel is set 
 *                                    in the source file(r_riic_rx###.c) for each MCU folder
 *                                    instead of this file.
 *                                    Similarly, PORT register, ICU register, SYSTEM register also varies
 *                                    depending on the MCU.
 *                                    Therefore, process for port function assignment and interrupt settings
 *                                    and module stop enable/disble is set in the source file(r_riic_rx###.c) 
 *                                    for each MCU folder instead of this file.
 *                                    (### is 111 or 64m)
 *              : 22.09.2014 1.40     The module is updated to measure the issue that slave communication 
 *                                    is not available after an arbitration-lost occurs and the bus is locked. 
 *                                      The issue occurs when the following four conditions are all met.
 *                                         - RIIC FIT module rev. 1.30 or earlier is used.
 *                                         - RX device operates as both the master and the slave 
 *                                           in multi-master communication.
 *                                         - An arbitration-lost is detected when communicating as the master.
 *                                         - Communication other than master reception or slave reception is performed.
 *              : 14.11.2014 1.50     Added RX113 support.
 *              : 09.10.2014 1.60     Added RX71M support.
 *              : 20.10.2014 1.70     Added RX231 support.
 *              : 31.10.2015 1.80     Added RX130, RX230, RX23T support.
 *              : 04.03.2016 1.90     Added RX24T support.
 *                                    Modified calculation processing for ICBRH and ICBRL registers value
 *              : 01.10.2016 2.00     Fixed a program according to the Renesas coding rules.
 *              : 02.06.2017 2.10     Deleted interrupt functions of RIIC3.
 *                                    Fixed processing of the riic_bps_calc function.
 *              : 27.04.2018 2.30     Added "for", "while" and "do while" comment.
 *              : 15.10.2018 2.40     Added RX72T support.
 *              : 20.05.2019 2.41     Added support for GNUC and ICCRX.
 *                                    Fixed coding style.
 *              : 20.06.2019 2.42     Added RX23W support.
 *              : 30.07.2019 2.43     Added RX72M support.
 *              : 10.10.2019 2.44     Added RX13T support.
 *              : 22.11.2019 2.45     Added RX66N, RX72N support.
 *                                    Modified comment of API function to Doxygen style.
 *              : 30.06.2021 2.48     Modified "riic information" comment.
 *                                    Modified the problem of recursive call.
 *              : 16.12.2022 2.60     Fixed processing error of riic_bps_calc.
 *              : 31.03.2023 2.70     Fixed to comply with GSCE Coding Standards Rev.6.5.0.
 *                                    Apply a digital noise filter circuit to the riic_bps_calc function.
 *                                    Added new macros for SCL rise time and SCL fall time.
 *              : 15.03.2025 3.01     Updated disclaimer.
 *              : 30.10.2025 3.10     Added RX14T support.
                                      Fixed to comply with GSCE Coding Standards Rev.6.6.0.
 *              : 30.03.2026 3.11     Modified comment of API function to Doxygen style.
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Defines for RIIC support */
#include "r_riic_rx_if.h"
#include "r_riic_rx_private.h"

