cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* Data reception completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, riic_read_data_receiving }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, riic_arbitration_lost }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },

    /* Stop condition generation completion wait state */
    {
        { RIIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { RIIC_EV_EN_SLV_TRANSFER, NULL }, /* Enable Slave Transfer */
        { RIIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { RIIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { RIIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { RIIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { RIIC_EV_INT_RECEIVE, NULL }, /* Data Receiving Interrupt */
        { RIIC_EV_INT_STOP, riic_after_dtct_stop_cond }, /* Stop Condition Generation Interrupt */
        { RIIC_EV_INT_AL, NULL }, /* Arbitration-Lost Interrupt */
        { RIIC_EV_INT_NACK, riic_nack }, /* No Acknowledge Interrupt */
        { RIIC_EV_INT_TMO, riic_time_out }, /* Time out Interrupt */
    },
};

/**********************************************************************************************************************
 * Function Name: R_RIIC_Open
 *****************************************************************************************************************/ /**
 * @brief This function initializes the RIIC FIT module. This function must be called before calling any other API 
 *        functions.
 * @param[in,out] *p_riic_info
 *             This is the pointer to the I2C communication information structure. \n
 *             See section R_RIIC_Open in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_LOCK_FUNC       The API is locked by the other task
 * @retval    RIIC_ERR_INVALID_CHAN    Nonexistent channel
 * @retval    RIIC_ERR_INVALID_ARG     Invalid parameter
 * @retval    RIIC_ERR_OTHER           The event occurred is invalid in the current state
 * @details   Performs the initialization to start the RIIC communication. Sets the RIIC channel specified by the 
 *            parameter. If the state of the channel is 'uninitialized (RIIC_NO_INIT)', the following processes are 
 *            performed. \n
 *            \li Setting the state flag.
 *            \li Setting I/O ports.
 *            \li Allocating I2C output ports.
 *            \li Cancelling RIIC module-stop state.
 *            \li Initializing variables used by the API.
 *            \li Initializing the RIIC registers used for the RIIC communication.
 *            \li Disabling the RIIC interrupts.
 * @note      None
 */
riic_return_t R_RIIC_Open(riic_info_t * p_riic_info)
{
    bool chk = RIIC_FALSE;
    riic_return_t ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if (NULL == p_riic_info)
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }
#endif

    /*  ---- RIIC HARDWARE LOCK ---- */
    chk = riic_mcu_hardware_lock(p_riic_info->ch_no);
    if (RIIC_FALSE == chk)
    {
        /* Lock has already been acquired by another task. Needs to try again later. */
        return RIIC_ERR_LOCK_FUNC;
    }

    /* ---- INITIALIZE RIIC INTERNAL STATUS INFORMATION ---- */
    g_riic_ChStatus[p_riic_info->ch_no] = RIIC_NO_INIT;
    p_riic_info->dev_sts                = RIIC_NO_INIT;

    /* ---- INITIALIZE CHANNEL ---- */
    /* Calls the API function. */
    ret = riic_open(p_riic_info);

    return ret;
} /* End of function R_RIIC_Open() */

/***********************************************************************************************************************
 * Function Name: riic_open
 * Description  : sub function of R_RIIC_Open(). Initializes the I/O register for RIIC control.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_open(riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_IDLE);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_NONE);

    /* Sets the internal status. (Internal information initialization) */
    riic_api_status_set(p_riic_info, RIIC_STS_NO_INIT);

    /* Enables the IIC peripheral registers. */
    /* Includes I/O register read operation at the end of the following function. */
    /* RIIC HARDWARE ENABLE */
    riic_mcu_power_on(p_riic_info->ch_no);

    /* Initializes the IIC driver. */
    ret = riic_func_table(RIIC_EV_INIT, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        ret = RIIC_ERR_OTHER;

        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_NO_INIT);
    }
    else
    {
        /* Registers a callback function for supported interrupts. */
        riic_mcu_int_init(p_riic_info->ch_no);

#if (1U == RIIC_CFG_PORT_SET_PROCESSING)
        /* Init Port Processing */
        /* Ports open setting */
        /* Includes I/O register read operation at the end of the following function. */
        riic_mcu_io_open(p_riic_info->ch_no);

        /* Enables RIIC multi-function pin controller. */
        /* Includes I/O register read operation at the end of the following function. */
        riic_mcu_mpc_enable(p_riic_info->ch_no);
#endif
    }

    return ret;
} /* End of function riic_open() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_MasterSend
 *****************************************************************************************************************/ /**
 * @brief Starts master transmission. Changes the transmit pattern according to the parameters. Operates batched 
 *        processing until stop condition generation.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. The transmit patterns can be 
 *             selected from four patterns by the parameter setting. \n
 *             See section R_RIIC_MasterSend in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN    The channel is nonexistent
 * @retval    RIIC_ERR_INVALID_ARG     The parameter is invalid
 * @retval    RIIC_ERR_NO_INIT         Uninitialized state
 * @retval    RIIC_ERR_BUS_BUSY        The bus state is busy
 * @retval    RIIC_ERR_AL              Arbitration-lost error occurred
 * @retval    RIIC_ERR_TMO             Timeout is detected
 * @retval    RIIC_ERR_OTHER           The event occurred is invalid in the current state
 * @details   Starts the RIIC master transmission. The transmission is performed with the RIIC channel and transmit 
 *            pattern specified by parameters. If the state of the channel is 'idle (RIIC_IDLE, RIIC_FINISH, or 
 *            RIIC_NACK)', the following processes are performed. \n
 *            \li Setting the state flag.
 *            \li Initializing variables used by the API.
 *            \li Enabling the RIIC interrupts.
 *            \li Generating a start condition.
 * 
 *            This function returns RIIC_SUCCESS as a return value when the processing up to the start condition 
 *            generation ends normally. This function returns RIIC_ERR_BUS_BUSY as a return value when the following 
 *            conditions are met to the start condition generation ends normally. (Note.1) \n
 *            \li The internal status bit is in busy state.
 *            \li Either SCL or SDA line is in low state. 
 * 
 *            The transmission processing is performed sequentially in subsequent interrupt processing after this 
 *            function return RIIC_SUCCESS. Section "2.4 Usage of Interrupt Vector" in the application note should be 
 *            refered for the interrupt to be used. For master transmission, the interrupt generation timing should be 
 *            refered from "6.2.1 Master transmission" in the application note. \n
 *            After issuing a stop condition at the end of transmission, the callback function specified by the 
 *            argument is called. \n
 *            The transmission completion is performed normally or not, can be confirmed by checking the device status 
 *            flag specified by the argument or the channel status flag g_riic_ChStatus [], that is to be 
 *            "RIIC_FINISH" for normal completion.\n
 *            Notes:\n
 *            1. When SCL and SDA pin is not external pull-up, this function may return RIIC_ERR_BUS_BUSY by
 *               detecting either SCL or SDA line is as in low state.
 * @note      Available settings for each pattern see Section R_RIIC_MasterSend in the application note for details.
 */
riic_return_t R_RIIC_MasterSend(riic_info_t * p_riic_info)
{
    riic_return_t ret;

