cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if ((((NULL == p_riic_info) || ((0 == p_riic_info->cnt1st) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data1st)))
            || ((0 == p_riic_info->cnt2nd) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd)))
            || (NULL == p_riic_info->callbackfunc))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }
#endif

    /* Calls the API function. */
    ret = riic_master_send(p_riic_info);

    return ret;
} /* End of function R_RIIC_MasterSend() */

/***********************************************************************************************************************
 * Function Name: riic_master_send
 * Description  : sub function of R_RIIC_MasterSend().
 *              : Generates the start condition. Starts the master transmission.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_master_send(riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_COMMUNICATION);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_M_SEND);

    /* Copy p_riic_info address */
    priic_info_m[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc                              = p_riic_info->callbackfunc;
    g_riic_callbackfunc_m[p_riic_info->ch_no] = callbackfunc;

    /* Generates the start condition.  */
    ret = riic_func_table(RIIC_EV_GEN_START_COND, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        /* Initialize API status on RAM */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);
        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
            riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
        }
        else
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
        }
    }

    return ret;
} /* End of function riic_master_send() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_MasterReceive
 *****************************************************************************************************************/ /**
 * @brief Starts master reception. Changes the receive pattern according to the parameters. Operates batched processing 
 *        until stop condition generation.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. The receive pattern can be selected 
 *             from master reception and master transmit/receive by the parameter setting. \n
 *             See section R_RIIC_MasterReceive in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN    The channel is nonexistent
 * @retval    RIIC_ERR_INVALID_ARG     The parameter is invalid
 * @retval    RIIC_ERR_NO_INIT         Uninitialized state
 * @retval    RIIC_ERR_BUS_BUSY        The bus state is busy
 * @retval    RIIC_ERR_AL              Arbitration-lost error occurred
 * @retval    RIIC_ERR_TMO             Timeout is detected
 * @retval    RIIC_ERR_OTHER           The event occurred is invalid in the current state
 * @details   Starts the RIIC master reception. The reception is performed with the RIIC channel and receive pattern 
 *            specified by parameters. If the state of the channel is 'idle (RIIC_IDLE, RIIC_FINISH, or RIIC_NACK)', 
 *            the following processes are performed. \n
 *            \li Setting the state flag.
 *            \li Initializing variables used by the API.
 *            \li Enabling the RIIC interrupts.
 *            \li Generating a start condition.
 * 
 *            This function returns RIIC_SUCCESS as a return value when the processing up to the start condition 
 *            generation ends normally. This function returns RIIC_ERR_BUS_BUSY as a return value when the following 
 *            conditions are met to the start condition generation ends normally. (Note.1) \n
 *            \li The internal status bit is in busy state.
 *            \li Either SCL or SDA line is in low state.
 * 
 *            The reception processing is performed sequentially in subsequent interrupt processing after this 
 *            function return RIIC_SUCCESS. Section "2.4 Usage of Interrupt Vector" in the application note should be 
 *            refered for the interrupt to be used. For master transmission, the interrupt generation timing should be 
 *            refered from "6.2.2 Master Reception" in the application note . \n
 *            After issuing a stop condition at the end of reception, the callback function specified by the argument 
 *            is called. \n
 *            The reception completion is performed normally or not, can be confirmed by checking the device status 
 *            flag specified by the argument or the channel status flag g_riic_ChStatus [], that is to be 
 *            "RIIC_FINISH" for normal completion.\n
 *            Notes:\n
 *            1. When SCL and SDA pin is not external pull-up, this function may return RIIC_ERR_BUS_BUSY by
 *               detecting either SCL or SDA line is as in low state.
 * @note      Available settings for each receive pattern see Section R_RIIC_MasterReceive in the application note for
 *            details.
 */
riic_return_t R_RIIC_MasterReceive(riic_info_t * p_riic_info)
{
    riic_return_t ret;

