cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    /* Parameter check */
    if ((((((NULL == p_riic_info) || (NULL == p_riic_info->p_slv_adr))
            || ((0 != p_riic_info->cnt1st) && (NULL == p_riic_info->p_data1st))) || (NULL == p_riic_info->p_data2nd))
            || (0 == p_riic_info->cnt2nd)) || (NULL == p_riic_info->callbackfunc))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    if (0 == p_riic_info->cnt1st)
    {
        /* Calls the API function. */
        ret = riic_master_receive(p_riic_info);
    }
    else
    {
        /* Calls the API function. */
        ret = riic_master_send_receive(p_riic_info);
    }

    return ret;
} /* End of function R_RIIC_MasterReceive() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic_master_receive
 * Description  : sub function of R_RIIC_MasterReceive(). 
 *              : Generates the start condition. Starts the master reception.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_master_receive(riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_COMMUNICATION);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_M_RECEIVE);

    /* Copy p_riic_info address */
    priic_info_m[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc                              = p_riic_info->callbackfunc;
    g_riic_callbackfunc_m[p_riic_info->ch_no] = callbackfunc;

    /* Generates the start condition. */
    ret = riic_func_table(RIIC_EV_GEN_START_COND, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        /* Initialize API status on RAM */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);
        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
            riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
        }
        else
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
        }
    }

    return ret;
} /* End of function riic_master_receive() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic_master_send_receive
 * Description  : sub function of R_RIIC_MasterReceive().
 *              : Generates the start condition. Starts the master reception.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_master_send_receive(riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_COMMUNICATION);

    /* Initialize API status on RAM */
    riic_api_mode_event_init(p_riic_info, RIIC_MODE_M_SEND_RECEIVE);

    /* Copy p_riic_info address */
    priic_info_m[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc                              = p_riic_info->callbackfunc;
    g_riic_callbackfunc_m[p_riic_info->ch_no] = callbackfunc;

    /* Generates the start condition. */
    ret = riic_func_table(RIIC_EV_GEN_START_COND, p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        /* Initialize API status on RAM */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);
        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
            riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
        }
        else
        {
            riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
        }
    }

    return ret;
} /* End of function riic_master_send_receive() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_SlaveTransfer
 *****************************************************************************************************************/ /**
 * @brief This function performs slave transmission and reception. Changes the transmit and receive pattern according 
 *        to the parameters.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. The operation can be selected from 
 *             preparation for slave reception, slave transmission, or both of them by the parameter setting. \n
 *             See section R_RIIC_SlaveTransfer in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN    The channel is nonexistent
 * @retval    RIIC_ERR_INVALID_ARG     The parameter is invalid
 * @retval    RIIC_ERR_NO_INIT         Uninitialized state
 * @retval    RIIC_ERR_BUS_BUSY        The bus state is busy
 * @retval    RIIC_ERR_AL              Arbitration-lost error occurred
 * @retval    RIIC_ERR_TMO             Timeout is detected
 * @retval    RIIC_ERR_OTHER           The event occurred is invalid in the current state
 * @details   Prepares for the RIIC slave transmission or slave reception. If this function is called while the master 
 *            is communicating, an error occurs. Sets the RIIC channel specified by the parameter. If the state of the 
 *            channel is 'idle (RIIC_IDLE, RIIC_FINISH, or RIIC_NACK)', the following processes are performed. \n
 *            \li Setting the state flag.
 *            \li Initializing variables used by the API.
 *            \li Initializing the RIIC registers used for the RIIC communication.
 *            \li Enabling the RIIC interrupts.
 *            \li Setting the slave address and enabling the slave address match interrupt.
 *
 *            This function returns RIIC_SUCCESS as a return value when the setting of slave address and permission of 
 *            slave address match interrupt are completed normally. \n
 *            The processing of slave transmission or slave reception is performed sequentially in the subsequent 
 *            interrupt processing. \n
 *            Section "2.4 Usage of Interrupt Vector" in the application note should be refered for the interrupt to 
 *            be used. \n
 *            The interrupt generation timing of slave transmission should be refered from "6.2.4 Slave Transmission" 
 *            in the application note. The interrupt generation timing for slave reception should be refered from 
 *            "6.2.5 Slave reception" in the application note. \n
 *            After detecting the stop condition of slave transmission or slave reception termination, the callback 
 *            function specified by the argument is called. \n
 *            The successful completion of slave reception can be checked by confirming the device status flag or 
 *            channel status flag specified in the argument  g_riic_ChStatus [], that is to be "RIIC_FINISH". The 
 *            successful completion of slave transmission can be checked by confirming the device status flag or 
 *            channel status flag specified in the argument g_riic_ChStatus [], that is to be "RIIC_FINISH" or 
 *            "RIIC_NACK". "RIIC_NACK" is set when master device transmitted NACK for notify to the slave that last 
 *            data receive completed.
 * @note      Available settings for each receive pattern see Section R_RIIC_SlaveTransfer in the application note for
 *            details.
 */
riic_return_t R_RIIC_SlaveTransfer(riic_info_t * p_riic_info)
{
    riic_return_t ret;

