cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    /* Parameter check */
    if (((NULL == p_riic_info)
            || (((uint8_t *)FIT_NO_PTR == p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR == p_riic_info->p_data2nd)))
            || (NULL == p_riic_info->callbackfunc))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* Calls the API function. */
    ret = riic_slave_transfer(p_riic_info);

    return ret;
} /* End of function R_RIIC_SlaveTransfer() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic_slave_transfer
 * Description  : sub function of R_RIIC_SlaveTransfer.
 *              : Generates the start condition. Starts the slave reception and the slave transmission.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_slave_transfer(riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_callback callbackfunc = NULL;

    /* Checks the channel status. */
    ret = riic_check_chstatus_start(p_riic_info);

    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    if (RIIC_MODE_S_READY != riic_api_info[p_riic_info->ch_no].N_Mode)
    {
        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);

        /* Initialize API status on RAM */
        riic_api_mode_event_init(p_riic_info, RIIC_MODE_S_READY);

        /* Generates the start condition. */
        ret = riic_func_table(RIIC_EV_EN_SLV_TRANSFER, p_riic_info);
    }

    /* Copy p_riic_info address */
    priic_info_s[p_riic_info->ch_no] = p_riic_info;

    /* Sets the callback function. */
    callbackfunc                              = p_riic_info->callbackfunc;
    g_riic_callbackfunc_s[p_riic_info->ch_no] = callbackfunc;

    /* ---- Enables IIC bus interrupt enable register. ---- */
    if (((uint8_t *)FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enables slave send and slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX_RX);
    }
    else if (((uint8_t *)FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR == p_riic_info->p_data2nd))
    {
        /* Enable slave send */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX);
    }
    else if (((uint8_t *)FIT_NO_PTR == p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enable slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX);
    }
    else
    {
        /* Do Nothing */
    }

    return ret;
} /* End of function riic_slave_transfer() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_GetStatus
 *****************************************************************************************************************/ /**
 * @brief Returns the state of this module.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. \n
 *             See section R_RIIC_GetStatus in the application note for details.
 * @param[in] *p_riic_status
 *             This contains the variable to store the RIIC state. \n
 *             See section R_RIIC_GetStatus in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN    The channel is nonexistent
 * @retval    RIIC_ERR_INVALID_ARG     The parameter is invalid
 * @details   Returns the state of this module. \n
 *            By reading the register, pin level, variable, or others, obtains the state of the RIIC channel which 
 *            specified by the parameter, and returns the obtained state as 32-bit structure. \n
 *            When this function is called, the RIIC arbitration-lost flag and NACK flag are cleared to 0. If the 
 *            device state is "RIIC_ AL", the value is updated to "RIIC_FINISH". \n
 * @note      The state flag allocation see Section R_RIIC_GetStatus in the application note for details.
 */
riic_return_t R_RIIC_GetStatus(riic_info_t *p_riic_info, riic_mcu_status_t *p_riic_status)
{
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)

    if ((NULL == p_riic_info) || (NULL == p_riic_status))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* Calls the API function. */
    riic_getstatus(p_riic_info, p_riic_status);

    return RIIC_SUCCESS;
} /* End of function R_RIIC_GetStatus() */

/***********************************************************************************************************************
 * Function Name: riic_getstatus
 * Description  : sub function of R_RIIC_GetStatus.
 *                Returns the state of this module.
 *                Obtains the state of the RIIC channel, which specified by the parameter, by reading the register,
 *                variable, or others, and returns the obtained state as 32-bit structure.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *                riic_mcu_status_t * p_riic_status ; The address to store the I2C state flag.
 * Return Value : none
 **********************************************************************************************************************/
static void riic_getstatus(riic_info_t *p_riic_info, riic_mcu_status_t *p_riic_status)
{
    volatile uint8_t uctmp = 0x00;
    volatile riic_mcu_status_t sts_flag;
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr1_reg = RIIC_ICSR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);

    sts_flag.LONG = 0x00000000;

    /* ---- Check Bus state ---- */
    if (RIIC_ICCR2_BBSY_SET == ((*piccr2_reg) & RIIC_ICCR2_BBSY))
    {
        sts_flag.BIT.BSY = 1U;
    }
    else
    {
        sts_flag.BIT.BSY = 0U;
    }

    /* ---- Check Mode ---- */
    if (RIIC_ICCR2_TRS_SET == ((*piccr2_reg) & RIIC_ICCR2_TRS))
    {
        /* Send */
        sts_flag.BIT.TRS = 1U;
    }
    else
    {
        /* Receive */
        sts_flag.BIT.TRS = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_NACKF_SET == ((*picsr2_reg) & RIIC_ICSR2_NACKF))
    {
        /* NACK translation detected*/
        sts_flag.BIT.NACK = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.NACK = 0U;
    }

