cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* ---- Check Send buffer status ---- */
    if (RIIC_ICSR2_TDRE_SET == ((*picsr2_reg) & RIIC_ICSR2_TDRE))
    {
        /* Send buffer empty */
        sts_flag.BIT.SBUF = 1U;
    }
    else
    {
        /* Send buffer not empty */
        sts_flag.BIT.SBUF = 0U;
    }

    /* ---- Check Receive buffer status ---- */
    if (RIIC_ICSR2_RDRF_SET == ((*picsr2_reg) & RIIC_ICSR2_RDRF))
    {
        /* Receive buffer not empty */
        sts_flag.BIT.RBUF = 1U;
    }
    else
    {
        /* Receive buffer empty */
        sts_flag.BIT.RBUF = 0U;
    }

    /* ---- Check SDA pin level ---- */
    if (RIIC_ICCR1_SDAI_SET == ((*piccr1_reg) & RIIC_ICCR1_SDAI))
    {
        /* SDA pin is High level */
        sts_flag.BIT.SDAI = 1U;
    }
    else
    {
        /* SDA pin is Low level */
        sts_flag.BIT.SDAI = 0U;
    }

    /* ---- Check SCL pin level ---- */
    if (RIIC_ICCR1_SCLI_SET == ((*piccr1_reg) & RIIC_ICCR1_SCLI))
    {
        /* SCL pin is High level */
        sts_flag.BIT.SCLI = 1U;
    }
    else
    {
        /* SCL pin is Low level */
        sts_flag.BIT.SCLI = 0U;
    }

    /* ---- Check SDA output control status ---- */
    if (RIIC_ICCR1_SDAO_SET == ((*piccr1_reg) & RIIC_ICCR1_SDAO))
    {
        /* SDA pin is Open */
        sts_flag.BIT.SDAO = 1U;
    }
    else
    {
        /* SDA pin is Low hold */
        sts_flag.BIT.SDAO = 0U;
    }

    /* ---- Check SCL output control status ---- */
    if (RIIC_ICCR1_SCLO_SET == ((*piccr1_reg) & RIIC_ICCR1_SCLO))
    {
        /* SCL pin is Open */
        sts_flag.BIT.SCLO = 1U;
    }
    else
    {
        /* SCL pin is Low hold */
        sts_flag.BIT.SCLO = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_START_SET == ((*picsr2_reg) & RIIC_ICSR2_START))
    {
        /* Start condition detected*/
        sts_flag.BIT.ST = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.ST = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_STOP_SET == ((*picsr2_reg) & RIIC_ICSR2_STOP))
    {
        /* Stop condition detected*/
        sts_flag.BIT.SP = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.SP = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
    {
        /* Arbitration lost detected*/
        sts_flag.BIT.AL = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AL = 0U;
    }

    /* ---- Check Event detection ---- */
    if (RIIC_ICSR2_TMOF_SET == ((*picsr2_reg) & RIIC_ICSR2_TMOF))
    {
        /* Time out detected*/
        sts_flag.BIT.TMO = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.TMO = 0U;
    }

    /* ---- Check Master/Slave Mode ---- */
    if (RIIC_ICCR2_MST_SET == ((*piccr2_reg) & RIIC_ICCR2_MST))
    {
        /* Master Mode */
        sts_flag.BIT.MST = 1U;
    }
    else
    {
        /* Slave Mode */
        sts_flag.BIT.MST = 0U;
    }

    /* ---- Check Host Address detection ---- */
    if (RIIC_ICSR1_HOA_SET == ((*picsr1_reg) & RIIC_ICSR1_HOA))
    {
        /* Host Address detected */
        sts_flag.BIT.HOA = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.HOA = 0U;
    }

    /* ---- Check Device ID Address detection ---- */
    if (RIIC_ICSR1_DID_SET == ((*picsr1_reg) & RIIC_ICSR1_DID))
    {
        /* Device ID Address detected */
        sts_flag.BIT.DID = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.DID = 0U;
    }

    /* ---- Check Generalcall Address detection ---- */
    if (RIIC_ICSR1_GCA_SET == ((*picsr1_reg) & RIIC_ICSR1_GCA))
    {
        /* Generalcall Address detected */
        sts_flag.BIT.GCA = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.GCA = 0U;
    }

    /* ---- Check Slave0 Address detection ---- */
    if (RIIC_ICSR1_AAS0_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS0))
    {
        /* Slave0 Address detected */
        sts_flag.BIT.AAS0 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS0 = 0U;
    }

    /* ---- Check Slave1 Address detection ---- */
    if (RIIC_ICSR1_AAS1_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS1))
    {
        /* Slave1 Address detected */
        sts_flag.BIT.AAS1 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS1 = 0U;
    }

    /* ---- Check Slave2 Address detection ---- */
    if (RIIC_ICSR1_AAS2_SET == ((*picsr1_reg) & RIIC_ICSR1_AAS2))
    {
        /* Slave2 Address detected */
        sts_flag.BIT.AAS2 = 1U;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.AAS2 = 0U;
    }

    /* ---- Set the state ---- */
    *p_riic_status = sts_flag;

    /* ---- clear flag ---- */
    (*picsr2_reg) &= RIIC_ICSR2_AL_CLR;
    (*picsr2_reg) &= RIIC_ICSR2_NACKF_CLR;
    uctmp          = *picsr2_reg;

    if (RIIC_AL == g_riic_ChStatus[p_riic_info->ch_no])
    {
        /* Initialize the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_FINISH);
    }
} /* End of function riic_getstatus() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_Control
 *****************************************************************************************************************/ /**
 * @brief This function outputs conditions, Hi-Z from the SDA, and one-shot of the SCL clock. Also it resets the 
 *        settings of this module. This function is mainly used when a communication error occurs.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. \n
 *             See section R_RIIC_Control in the application note for details.
 * @param[in] ctrl_ptn
 *             Specifies the output pattern. See Section R_RIIC_Control in the application note for details.
 * @retval    RIIC_SUCCESS             Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN    Nonexistent channel
 * @retval    RIIC_ERR_INVALID_ARG     Invalid parameter
 * @retval    RIIC_ERR_BUS_BUSY        Bus is busy
 * @retval    RIIC_ERR_AL              Arbitration-lost error occurred
 * @retval    RIIC_ERR_OTHER           The event occurred is invalid in the current state
 * @details   Outputs control signals of the RIIC. Outputs conditions specified by the argument, Hi-Z from the SDA pin, 
 *            and one-shot of the SCL clock. Also resets the RIIC module settings.
 * @note      One-shot output of the SCL clock. \n
 *            In master mode, if the clock signals from the master and slave devices go out of synchronization due to 
 *            noise or other factors, the slave device may hold the SDA line low (bus hang up). Then the SDA line can 
 *            be released from being held low by outputting one clock of the SCL at a time. \n
 *            In this module, one clock of the SCL can be output by setting the output pattern "RIIC_GEN_SCL_ONESHOT" 
 *            (one-shot output of the SCL clock) and calling R_RIIC_Control().
 */
riic_return_t R_RIIC_Control(riic_info_t * p_riic_info, uint8_t ctrl_ptn)
{
    riic_return_t ret;

