cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)

    if ((NULL == p_riic_info) || (0 == ctrl_ptn))
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* Calls the API function. */
    ret = riic_control(p_riic_info, ctrl_ptn);

    return ret;
} /* End of function R_RIIC_Control() */

/***********************************************************************************************************************
 * Function Name: riic_control
 * Description  : sub function of R_RIIC_Control.
 *                This function is mainly used when a communication error occurs.
 *                Outputs control signals of the simple I2C mode.
 *                Outputs conditions specified by the argument, NACK,
 *                and one-shot of the SSCL clock. Also resets the simple I2C mode settings.
 * Arguments    : r_iic_info_t * p_riic_info     ; IIC Information
 *                uint8_t cntl_ptn               ; Output Pattern
 *                 [Options]
 *                  RIIC_GEN_START_CON
 *                  RIIC_GEN_STOP_CON
 *                  RIIC_GEN_RESTART_CON 
 *                  RIIC_GEN_SDA_HI_Z
 *                  RIIC_GEN_SCL_ONESHOT
 *                  RIIC_GEN_RESET
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_control(riic_info_t * p_riic_info, uint8_t ctrl_ptn)
{
    volatile riic_return_t ret = RIIC_SUCCESS;
    volatile uint8_t uctmp = 0x00;
    volatile uint32_t cnt = 0x00000000;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Disable all RIIC interrupt */
    riic_int_disable(p_riic_info);

    /* ==== Release reset(IICRST) of RIIC ==== */
    riic_reset_clear(p_riic_info);

    if (RIIC_ICCR1_ICE_SET != ((*piccr1_reg) & RIIC_ICCR1_ICE)) /* Check ICCR1.ICE = 0 */
    {
        /* Set ICE bit to enable RIIC modeule */
        (*piccr1_reg) |= RIIC_ICCR1_ICE_SET;
    }

    if ((0 != (uint8_t) (((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) & ctrl_ptn))
       && (0 == (uint8_t) (((RIIC_GEN_SDA_HI_Z | RIIC_GEN_SCL_ONESHOT) | RIIC_GEN_RESET) & ctrl_ptn)))
    {
        /* ==== Check request output pattern ==== */
        /* ---- Generate the start condition ---- */
        if (RIIC_GEN_START_CON == (ctrl_ptn & RIIC_GEN_START_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET == ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "1"(Bus busy) */
                ret = RIIC_ERR_BUS_BUSY;
                return ret;
            }

            /* Generates the start condition. */
            riic_start_cond_generate(p_riic_info);

            /* Wait the request generation has been completed */
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;

            /* WAIT_LOOP */
            while (RIIC_ICSR2_START_SET != ((*picsr2_reg) & RIIC_ICSR2_START))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear START detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
        }

        /* ---- Generate the restart condition ---- */
        if (RIIC_GEN_RESTART_CON == (ctrl_ptn & RIIC_GEN_RESTART_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET != ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "0"(Not Bus busy) */
                ret = RIIC_ERR_OTHER;
                return ret;
            }

            /* Generates the restart condition. */
            riic_re_start_cond_generate(p_riic_info);

            /* Wait the request generation has been completed*/
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;

            /* WAIT_LOOP */
            while (RIIC_ICSR2_START_SET != ((*picsr2_reg) & RIIC_ICSR2_START))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear START detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
        }

        /* ---- Generate the stop condition ---- */
        if (RIIC_GEN_STOP_CON == (ctrl_ptn & RIIC_GEN_STOP_CON))
        {
            /* Checks bus busy. */
            if (RIIC_ICCR2_BBSY_SET != ((*piccr2_reg) & RIIC_ICCR2_BBSY))
            {
                /* When BBSY bit is "0"(Not Bus busy) */
                ret = RIIC_ERR_OTHER;
                return ret;
            }

            /* Generates the stop condition. */
            riic_stop_cond_generate(p_riic_info);

            /* Wait the request generation has been completed*/
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;

            /* WAIT_LOOP */
            while (RIIC_ICSR2_STOP_SET != ((*picsr2_reg) & RIIC_ICSR2_STOP))
            {
                /* Check Arbitration */
                if (RIIC_ICSR2_AL_SET == ((*picsr2_reg) & RIIC_ICSR2_AL))
                {
                    /* When AL bit is "1" */
                    ret = RIIC_ERR_AL;
                    return ret;
                }

                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }

            /* Clear STOP detect bit */
            (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;
        }
    }
    else if ((0x00 != (uint8_t) ((RIIC_GEN_SDA_HI_Z | RIIC_GEN_SCL_ONESHOT) & ctrl_ptn)) &&
             (0x00 == (uint8_t) ((((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) |
            RIIC_GEN_RESET) & ctrl_ptn)))
    {
        /* ---- Select SDA pin in a high-impedance state ---- */
        if (RIIC_GEN_SDA_HI_Z == (ctrl_ptn & RIIC_GEN_SDA_HI_Z))
        {
            /* Changes the SDA pin in a high-impedance state. */
            /* Sets for ICCR1.SDAO bit. */
            *piccr1_reg = (uint8_t) (((*piccr1_reg) | RIIC_ICCR1_SDAO_SET) & RIIC_ICCR1_SOWP_CLR);
        }

        /* ---- Generate OneShot of SSCL clock ---- */
        if (RIIC_GEN_SCL_ONESHOT == (ctrl_ptn & RIIC_GEN_SCL_ONESHOT))
        {
            /* Output SCL oneshot */
            (*piccr1_reg) |= RIIC_ICCR1_CLO_SET;

