cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
            /* Wait output scl oneshot has been completed */
            cnt = RIIC_CFG_BUS_CHECK_COUNTER;

            /* WAIT_LOOP */
            while (RIIC_ICCR1_CLO_SET == ((*piccr1_reg) & RIIC_ICCR1_CLO_SET))
            {
                /* Check Reply */
                if (0x00000000 < cnt)
                {
                    cnt--;
                }
                else
                {
                    /* Set SCLO bit is "1"(Hi-z). */
                    *piccr1_reg = (uint8_t) (((*piccr1_reg) | RIIC_ICCR1_SCLO_SET) & RIIC_ICCR1_SOWP_CLR);

                    /* When Non Reply */
                    ret = RIIC_ERR_BUS_BUSY;
                    return ret;
                }
            }
        }
    }
    else if ((0x00 != (uint8_t) ((RIIC_GEN_RESET) & ctrl_ptn)) &&
             (0x00 == (uint8_t) (((((RIIC_GEN_START_CON | RIIC_GEN_RESTART_CON) | RIIC_GEN_STOP_CON) |
            RIIC_GEN_SDA_HI_Z) | RIIC_GEN_SCL_ONESHOT) & ctrl_ptn)))
    {
        /* ---- Generate Reset ---- */
        /* Updates the channel status. */
        riic_set_ch_status(p_riic_info, RIIC_IDLE);

        /* Initialize API status on RAM */
        riic_api_mode_event_init(p_riic_info, RIIC_MODE_NONE);

        /* Initializes the IIC registers. */
        /* Sets the internal status. */
        /* Enables the interrupt. */
        /* Clears the RIIC reset or internal reset. */
        riic_enable(p_riic_info);
    }
    else
    {
        /* parameter error */
        ret = RIIC_ERR_INVALID_ARG;
    }
    uctmp = *piccr1_reg;

    riic_clear_ir_flag(p_riic_info); /* Clear IR flag for RXI and TXI */

    return ret;
} /* End of function riic_control() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_Close
 *****************************************************************************************************************/ /**
 * @brief This function completes the RIIC communication and releases the RIIC used.
 * @param[in] *p_riic_info
 *             This is the pointer to the I2C communication information structure. \n
 *             See section R_RIIC_Close in the application note for details.
 * @retval    RIIC_SUCCESS           Processing completed successfully
 * @retval    RIIC_ERR_INVALID_CHAN  The channel is nonexistent
 * @retval    RIIC_ERR_INVALID_ARG   Invalid parameter
 * @details   Configures the settings to complete the RIIC communication. Disables the RIIC channel specified by the 
 *            parameter. The following processes are performed in this function. \n
 *            \li Entering the RIIC module-stop state.
 *            \li Releasing I2C output ports.
 *            \li Disabling the RIIC interrupt.
 * 
 *            To restart the communication, call the R_RIIC_Open() function (initialization function). If the 
 *            communication is forcibly terminated, that communication is not guaranteed. \n
 * @note      None
 */
riic_return_t R_RIIC_Close(riic_info_t * p_riic_info)
{
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == RIIC_CFG_PARAM_CHECKING_ENABLE)
    if (NULL == p_riic_info)
    {
        return RIIC_ERR_INVALID_ARG;
    }

    /* ---- CHECK CHANNEL ---- */
    if (false == riic_mcu_check_channel(p_riic_info->ch_no))
    {
        return RIIC_ERR_INVALID_CHAN;
    }

#endif

    /* ---- Hardware Unlock ---- */
    riic_mcu_hardware_unlock(p_riic_info->ch_no);

    /* Calls the API function. */
    riic_close(p_riic_info);

    return RIIC_SUCCESS;
} /* End of function R_RIIC_Close() */

/***********************************************************************************************************************
 * Function Name: riic_close
 * Description  : sub function of R_RIIC_Close. 
 *                Resets the RIIC driver.
 *              : The processing performs internal reset by setting to ICCR1.IICRST bit.
 *              : Forcibly, stops the IIC communication.
 *              : After called the processing, channel status becomes "RIIC_NO_INIT".
 *              : When starts the communication again, please call an initialization processing.
 * Arguments    : riic_info_t * p_riic_info      ;   IIC Information
 * Return Value : none
 **********************************************************************************************************************/
static void riic_close(riic_info_t * p_riic_info)
{
    /* Updates the channel status. */
    riic_set_ch_status(p_riic_info, RIIC_NO_INIT);

    /* Disables IIC. */
    riic_disable(p_riic_info);

#if (1U == RIIC_CFG_PORT_SET_PROCESSING)
    /* Disables RIIC multi-function pin controller after setting SCL and SDA to Hi-z by Reset. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_mcu_mpc_disable(p_riic_info->ch_no);
#endif

    riic_mcu_power_off(p_riic_info->ch_no);
} /* End of function riic_close() */

/**********************************************************************************************************************
 * Function Name: R_RIIC_GetVersion
 *****************************************************************************************************************/ /**
 * @brief Returns the current version of this module.
 * @return    Version number
 * @details   This function will return the version of the currently installed RIIC FIT module. The version number is 
 *            encoded where the top 2 bytes are the major version number and the bottom 2 bytes are the minor version 
 *            number. For example, Version 4.25 would be returned as 0x00040019.
 * @note      None
 */
uint32_t R_RIIC_GetVersion(void)
{
    uint32_t const version = (RIIC_VERSION_MAJOR << 16) | RIIC_VERSION_MINOR;

    return version;
} /* End of function R_RIIC_GetVersion() */

/***********************************************************************************************************************
 * Function Name: r_riic_advance
 * Description  : Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : riic_info_t * p_riic_info     ;   IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_INVALID_ARG           ; Parameter error
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t r_riic_advance(riic_info_t * p_riic_info)
{
    riic_return_t ret;

    /* Parameter check */
    if (NULL == p_riic_info)
    {
        ret = RIIC_ERR_INVALID_ARG;
    }
    else
    {
        /* Calls the API function. */
        ret = riic_advance(p_riic_info);
    }

    return ret;
} /* End of function r_riic_advance() */

