cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_advance
 * Description  : sub function of r_riic_advance.
 *                Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : riic_info_t * p_riic_info     ;   IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy
 *              : RIIC_ERR_NO_INIT               ; Uninitialized state
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                   ; Time out error
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_advance(riic_info_t * p_riic_info)
{
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picier_reg = RIIC_ICIER_ADR(p_riic_info->ch_no);
    riic_return_t ret;

    /* Checks the channel status. */
    ret = riic_check_chstatus_advance(p_riic_info);
    if (RIIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Event happened? */
    if (RIIC_EV_INIT != riic_api_event[p_riic_info->ch_no])
    {
        /* IIC communication processing */
        ret = riic_func_table(riic_api_event[p_riic_info->ch_no], p_riic_info);

        /* return value? */
        switch (ret)
        {
            case RIIC_SUCCESS :
                if (RIIC_STS_TMO == riic_api_info[p_riic_info->ch_no].N_status)
                {
                    /* Checks the callback function. */
                    if ((((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        riic_set_ch_status(priic_info_m[p_riic_info->ch_no], RIIC_TMO);
                        if (NULL != g_riic_callbackfunc_m[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_m[p_riic_info->ch_no]();
                        }
                    }

                    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                    {
                        riic_set_ch_status(priic_info_s[p_riic_info->ch_no], RIIC_TMO);
                        if (NULL != g_riic_callbackfunc_s[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_s[p_riic_info->ch_no]();
                        }
                    }
                }

                else if (((RIIC_STS_SP_COND_WAIT != riic_api_info[p_riic_info->ch_no].N_status)
                        || (0x00 != ((*picsr2_reg) & RIIC_ICSR2_STOP))) || (0x00 != ((*picier_reg) & RIIC_ICIER_SP)))
                {
                    /* Advances communication. (Not finished) */
                    /* Do Nothing */
                }
                else
                {
                    /* Finished communication.(after detect stop condition) */
                    /* Updates the channel status. */
                    if (RIIC_ICSR2_AL == ((*picsr2_reg) & RIIC_ICSR2_AL))
                    {
                        if (((RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].N_Mode)
                                || (RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode))
                                || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                        {
                            riic_set_ch_status(priic_info_s[p_riic_info->ch_no], RIIC_FINISH);
                        }

                        riic_set_ch_status(priic_info_m[p_riic_info->ch_no], RIIC_AL);
                    }
                    else if (RIIC_ICSR2_NACKF == ((*picsr2_reg) & RIIC_ICSR2_NACKF))
                    {
                        riic_set_ch_status(p_riic_info, RIIC_NACK);
                    }
                    else
                    {
                        riic_set_ch_status(p_riic_info, RIIC_FINISH);
                    }

                    /* Save transfer direction to rsv1 before callback */
                    if (RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                    {
                        p_riic_info->rsv1 = 1; /* Slave transmit (master read) */
                    }
                    else if (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode)
                    {
                        p_riic_info->rsv1 = 0; /* Slave receive (master write) */
                    }

                    /* Checks the callback function. */
                    if ((((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        if (NULL != g_riic_callbackfunc_m[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_m[p_riic_info->ch_no]();
                        }
                    }

