cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
                    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
                    {
                        if (NULL != g_riic_callbackfunc_s[p_riic_info->ch_no])
                        {
                            g_riic_callbackfunc_s[p_riic_info->ch_no]();
                        }
                    }

                    /* Return to the last mode */
                    if ((RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].N_Mode)
                            || (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode))
                    {
                        /* Initialize API status on RAM */
                        riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
                        riic_api_mode_set(p_riic_info, RIIC_MODE_S_READY);
                        riic_api_status_set(p_riic_info, RIIC_STS_IDLE_EN_SLV);

                    if(0)// ↓↓↓ 加这 3 行 ↓↓↓
					{
						volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);
						(*picser_reg) |= RIIC_ICSER_SAR0E_SET;
					}
					// ↑↑↑ 加这 3 行 ↑↑↑

                    /* ---- Enables IIC bus interrupt enable register. ---- */
                    if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                            && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                    {
                        /* Enables slave send and slave receive */
                        riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_RX);
                    }
                        else if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                && ((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                        {
                            /* Enable slave send */
                            riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX);
                        }
                        else if (((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                                && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                        {
                            /* Enable slave receive */
                            riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX);
                        }
                        else
                        {
                            /* Do Nothing */
                        }
                    }
                    else
                    {
                        /* Initialize API status on RAM */
                        riic_api_mode_set(p_riic_info, RIIC_MODE_NONE);
                        riic_api_status_set(p_riic_info, RIIC_STS_IDLE);

                        /* Initializes ICIER register. */
                        *picier_reg = RIIC_ICIER_INIT;

                        /* WAIT_LOOP */
                        while (RIIC_ICIER_INIT != (*picier_reg))
                        {
                            /* Do Nothing */
                        }
                    }
                }
                break;

            default :

                /* Updates the channel status. */
                riic_set_ch_status(p_riic_info, RIIC_ERROR);
                break;
        }
    }

    /* Event nothing. */
    else
    {
        ret = RIIC_ERR_OTHER;
    }

    return ret;
} /* End of function riic_advance() */

/***********************************************************************************************************************
 * Function Name: riic_func_table
 * Description  : IIC Protocol Execution Processing.
 *                Executes the function which set in "pfunc".
 * Arguments    : riic_api_event_t event    ; Event
 *              : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : Refer to the each calling function.
 **********************************************************************************************************************/
static riic_return_t riic_func_table(riic_api_event_t event, riic_info_t * p_riic_info)
{
    riic_return_t ret;
    riic_return_t (*pFunc) (riic_info_t *);
    riic_api_status_t n_status;

    /* Acquires a now state. */
    n_status = riic_api_info[p_riic_info->ch_no].N_status;

    /* Checks the parameter. */
    if ((RIIC_STS_MAX > n_status) && (RIIC_EV_MAX > event))
    {
        /* Checks the appointed function. */
        if (NULL != gc_riic_mtx_tbl[n_status][event].proc)
        {
            /* Sets the function. */
            pFunc = gc_riic_mtx_tbl[n_status][event].proc;

            /* Event flag initialization. */
            riic_api_event[p_riic_info->ch_no] = RIIC_EV_INIT;

            /* Calls the status transition function. */
            ret = (*pFunc)(p_riic_info);
        }
        else
        {
            /* Appointed function error */
            ret = RIIC_ERR_OTHER;
        }
    }
    else
    {
        /* Appointed function error */
        ret = RIIC_ERR_OTHER;
    }

    return ret;
} /* End of function riic_func_table() */

/***********************************************************************************************************************
 * Function Name: riic_init_driver
 * Description  : Initialize IIC Driver Processing.
 *                Initializes the IIC registers.
 *              : Sets the internal status.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, idle state
 **********************************************************************************************************************/
static riic_return_t riic_init_driver(riic_info_t * p_riic_info)
{
    /* Initializes the IIC registers. */
    /* Sets the internal status. */
    /* Enables the interrupt. */
    /* Clears the RIIC reset or internal reset. */
    riic_enable(p_riic_info);

