cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
                        /* Sets the internal status. */
                        riic_api_status_set(p_riic_info, RIIC_STS_SEND_SLVADR_W_WAIT);

                        /* Enables the IIC bus interrupt. */
                        /* Transmit data empty interrupt request is enabled. */
                        if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
                        {
                            if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enables slave send and slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_TX_RX);
                            }
                            else if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave send */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_TX);
                            }
                            else if (((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                                    && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                            {
                                /* Enable slave receive */
                                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TEND_NAK_AL |
                                RIIC_ICIER_RX);
                            }
                            else
                            {
                                /* Do Nothing */
                            }
                        }
                        else
                        {
                            riic_int_icier_setting(p_riic_info, RIIC_ICIER_TEND_NAK_AL);
                        }

                        /* Transmits the slave address. */
                        riic_set_sending_data(p_riic_info, &buf_send_data);
                    }
                    break;

                    /* Previous status is data transfer completion waiting status. */
                case RIIC_STS_SEND_DATA_WAIT :

                    /* Sets a read code. */
                    buf_send_data  = (uint8_t) ((*(p_riic_info->p_slv_adr)) << 1U);
                    buf_send_data |= R_CODE;

                    /* Sets the internal status. */
                    riic_api_status_set(p_riic_info, RIIC_STS_SEND_SLVADR_R_WAIT);

                    /* Enables the IIC bus interrupt. */
                    riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX_NAK_AL);

                    /* Transmits the slave address. */
                    riic_set_sending_data(p_riic_info, &buf_send_data);

                    break;

                default :

                    /* None status. */
                    ret = RIIC_ERR_OTHER;
                    break;
            }
        break;

        case RIIC_MODE_M_RECEIVE :

            /* Sets a read code. */
            buf_send_data  = (uint8_t) ((*(p_riic_info->p_slv_adr)) << 1U);
            buf_send_data |= R_CODE;

            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SEND_SLVADR_R_WAIT);

            /* Enables the IIC bus interrupt. */
            if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
            {
                if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                        && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                {
                    /* Enables slave send and slave receive */
                    riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX_NAK_AL |
                    RIIC_ICIER_TX_RX);
                }
                else if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                        && ((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
                {
                    /* Enable slave send */
                    riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX_NAK_AL | RIIC_ICIER_TX);
                }
                else if (((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                        && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
                {
                    /* Enable slave receive */
                    riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX_NAK_AL | RIIC_ICIER_RX);
                }
                else
                {
                    /* Do Nothing */
                }
            }
            else
            {
                riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX_NAK_AL);
            }

            /* Transmits the slave address. */
            riic_set_sending_data(p_riic_info, &buf_send_data);

            break;

        default :
            ret = RIIC_ERR_OTHER;
            break;
    }
    return ret;
} /* End of function riic_after_gen_start_cond() */

/***********************************************************************************************************************
 * Function Name: riic_after_send_slvadr
 * Description  : After Slave Address Transmission Processing.
 *                Performs one of the following processing according to the state.
 *                Transmits a data. Generates the stop condition. Receives a data.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_after_send_slvadr(riic_info_t * p_riic_info)
{
    riic_return_t ret = RIIC_SUCCESS;
    volatile uint8_t uctmp = 0x00;

