cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* IIC mode? */
    switch (riic_api_info[p_riic_info->ch_no].N_Mode)
    {
        case RIIC_MODE_M_SEND :

            /* --- Pattern 1 of Master Write --- */
            if (((uint8_t *)FIT_NO_PTR != (uint8_t *)p_riic_info->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR != (uint8_t *)p_riic_info->p_data2nd))
            {
                /* Sets the internal status. */
                riic_api_status_set(p_riic_info, RIIC_STS_SEND_DATA_WAIT);

                /* Enables the IIC bus interrupt. */
                riic_int_icier_setting(p_riic_info, RIIC_ICIER_TEND_NAK_AL);

                /* 1st data counter = 0?  */
                if (0x00000000 != p_riic_info->cnt1st)
                {
                    /* Transmits a 1st data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_riic_info->cnt1st--;

                    /* Increases the 1st data buffer pointer. */
                    p_riic_info->p_data1st++;
                }
                else
                {
                    ret = RIIC_ERR_OTHER;
                }
            }

            /* --- Pattern 2 of Master Write --- */
            else if (((uint8_t *)FIT_NO_PTR == p_riic_info->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd))
            {
                /* Sets the internal status. */
                riic_api_status_set(p_riic_info, RIIC_STS_SEND_DATA_WAIT);

                /* Enables the IIC bus interrupt. */
                riic_int_icier_setting(p_riic_info, RIIC_ICIER_TEND_NAK_AL);

                /* 2nd data counter = 0?  */
                if (0x00000000 != p_riic_info->cnt2nd)
                {
                    /* Transmits a 2nd data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data2nd);

                    /* Decreases the 2nd data counter. */
                    p_riic_info->cnt2nd--;

                    /* Increases the 2nd data buffer pointer. */
                    p_riic_info->p_data2nd++;
                }
                else
                {
                    ret = RIIC_ERR_OTHER;
                }
            }

            /* --- Pattern 3 of Master Write --- */
            else if (((uint8_t *)FIT_NO_PTR == p_riic_info->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR == p_riic_info->p_data2nd))
            {
                /* Sets the internal status. */
                riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

                /* Enables the IIC bus interrupt. */
                riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_NAK_AL);

                /* Generates the stop condition. */
                riic_stop_cond_generate(p_riic_info);
            }
            else
            {
                ret = RIIC_ERR_OTHER;
            }

            break;

        case RIIC_MODE_M_RECEIVE :

            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_RECEIVE_DATA_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX_NAK_AL);

            if (2U >= p_riic_info->cnt2nd)
            {
                /* The period between the ninth clock cycle and the first clock cycle is held low. */
                riic_receive_wait_setting(p_riic_info);
            }

            if (0x00000001 >= p_riic_info->cnt2nd)
            {
                /* Processing before receiving the "last byte - 1byte" in RX. */
                riic_receive_pre_end_setting(p_riic_info);
            }

            /* Performs dummy read. */
            uctmp = riic_get_receiving_data(p_riic_info);

            break;

        case RIIC_MODE_M_SEND_RECEIVE :

            /* Now status? */
            switch (riic_api_info[p_riic_info->ch_no].N_status)
            {
                case RIIC_STS_SEND_SLVADR_W_WAIT :

                    /* Sets the internal status. */
                    riic_api_status_set(p_riic_info, RIIC_STS_SEND_DATA_WAIT);

                    /* Enables the IIC bus interrupt. */
                    riic_int_icier_setting(p_riic_info, RIIC_ICIER_TEND_NAK_AL);

                    /* Transmits a 1st data. */
                    riic_set_sending_data(p_riic_info, p_riic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_riic_info->cnt1st--;

                    /* Increases the 1st Data buffer pointer. */
                    p_riic_info->p_data1st++;

                    break;

                case RIIC_STS_SEND_SLVADR_R_WAIT :

                    /* Sets the internal status. */
                    riic_api_status_set(p_riic_info, RIIC_STS_RECEIVE_DATA_WAIT);

                    /* Enables the IIC bus interrupt. */
                    riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX_NAK_AL);

                    if (2U >= p_riic_info->cnt2nd)
                    {
                        /* The period between the ninth clock cycle and the first clock cycle is held low. */
                        riic_receive_wait_setting(p_riic_info);
                    }

                    if (0x00000001 >= p_riic_info->cnt2nd)
                    {
                        /* Processing before receiving the "last byte - 1byte" in RX. */
                        riic_receive_pre_end_setting(p_riic_info);
                    }

                    /* Performs dummy read. */
                    uctmp = riic_get_receiving_data(p_riic_info);

                    break;

                default :
                    ret = RIIC_ERR_OTHER;
                    break;
            }
        break;

        default :
            ret = RIIC_ERR_OTHER;
            break;

    }

    return ret;
} /* End of function riic_after_send_slvadr() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic_after_receive_slvadr
 * Description  : After Slave Address Receive Processing
 *                Performs one of the following processing according to the state.
 *                Transmits a data. Generates the stop condition. Receives a data.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_after_receive_slvadr(riic_info_t * p_riic_info)
{
    volatile uint8_t * const picsr2_reg    = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg    = RIIC_ICCR2_ADR(p_riic_info->ch_no);
    volatile uint8_t         uctmp         = 0x00;
    uint8_t                  blank_data[1] =
    { BLANK };

    /* Clears each status flag. */
    (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;

    /* WAIT_LOOP */
    while (0x00 != ((*picsr2_reg) & RIIC_ICSR2_STOP))
    {
        /* Do Nothing */
    }

    /* ---- Enables IIC bus interrupt enable register. ---- */
    if (((uint8_t *)FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enables slave send and slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX_RX_SP_NAK);
    }
    else if (((uint8_t *)FIT_NO_PTR != p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR == p_riic_info->p_data2nd))
    {
        /* Enable slave send */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_TX_SP_NAK);
    }
    else if (((uint8_t *)FIT_NO_PTR == p_riic_info->p_data1st) && ((uint8_t *)FIT_NO_PTR != p_riic_info->p_data2nd))
    {
        /* Enable slave receive */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_RX_SP);
    }
    else
    {
        /* Do Nothing */
    }

