cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_read_data_receiving
 * Description  : After Receiving Data Processing.
 *                Performs one of the following processing  according to the state.
 *                Receives a data. Generates stop condition.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 **********************************************************************************************************************/
static riic_return_t riic_read_data_receiving(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    if (0x00000003 >= p_riic_info->cnt2nd)
    {
        /* The period between the ninth clock cycle and the first clock cycle is held low. */
        riic_receive_wait_setting(p_riic_info);
    }

    if (0x00000002 >= p_riic_info->cnt2nd)
    {
        /* Processing before receiving the "last byte - 1byte" in RX. */
        riic_receive_pre_end_setting(p_riic_info);
    }

    if (0x00000001 >= p_riic_info->cnt2nd)
    {
        if (RIIC_MODE_S_RECEIVE != riic_api_info[p_riic_info->ch_no].N_Mode)
        {
            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_NAK_AL);

            /* Generates the stop condition. */
            riic_stop_cond_generate(p_riic_info);
        }

        if (0x00000000 != p_riic_info->cnt2nd)
        {
            /* Stores the received data. */
            *p_riic_info->p_data2nd = riic_get_receiving_data(p_riic_info);
            p_riic_info->cnt2nd--; /* Decreases the receiving data counter. */
            p_riic_info->p_data2nd++; /* Increases the receiving data buffer pointer. */
        }
        else
        {
            /* Performs dummy read. */
            uctmp = riic_get_receiving_data(p_riic_info);
        }

        /* Reception end setting */
        riic_receive_end_setting(p_riic_info);
    }
    else
    {
        /* Stores the received data. */
        *p_riic_info->p_data2nd = riic_get_receiving_data(p_riic_info);
        p_riic_info->cnt2nd--; /* Decreases the receiving data counter. */
        p_riic_info->p_data2nd++; /* Increases the receiving data buffer pointer. */
    }

    return RIIC_SUCCESS;
} /* End of function riic_read_data_receiving() */

/***********************************************************************************************************************
 * Function Name: riic_after_dtct_stop_cond
 * Description  : After Generating Stop Condition Processing.
 *                Checks bus busy.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, finished communication and idle state
 *              : RIIC_ERR_BUS_BUSY              ; Bus busy error
 *              : RIIC_ERR_AL                    ; Arbitration lost error
 *              : RIIC_ERR_TMO                  ; Time out error
 **********************************************************************************************************************/
static riic_return_t riic_after_dtct_stop_cond(riic_info_t * p_riic_info)
{
    riic_return_t ret                   = RIIC_SUCCESS;
    bool boolret                        = RIIC_FALSE;
    volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);

    /* Waits from "bus busy" to "bus ready". */
    boolret = riic_check_bus_busy(p_riic_info);
    if (RIIC_FALSE == boolret)
    {
        ret = RIIC_ERR_BUS_BUSY;
    }
    else
    {
        if (RIIC_TMO == g_riic_ChStatus[p_riic_info->ch_no])
        {
            ret = RIIC_ERR_TMO;
        }

        if (RIIC_AL == g_riic_ChStatus[p_riic_info->ch_no])
        {
            ret = RIIC_ERR_AL;
        }
    }

    if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* Disable slave address1 */
        (*picser_reg) &= RIIC_ICSER_SAR_DASABLE;
    }

    return ret;
} /* End of function riic_after_dtct_stop_cond() */

/***********************************************************************************************************************
 * Function Name: riic_arbitration_lost
 * Description  : Arbitration Lost Error Processing. 
 *                Returns RIIC_ERR_AL.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                    ; Arbitration lost error
 **********************************************************************************************************************/
static riic_return_t riic_arbitration_lost(riic_info_t * p_riic_info)
{
    /* Checks the internal mode. */
    /* slave transfer not enable in now */
    if (((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* slave transfer not enable in now and before */
        if ((((RIIC_MODE_M_SEND == riic_api_info[p_riic_info->ch_no].B_Mode)
                || (RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].B_Mode))
                || (RIIC_MODE_NONE == riic_api_info[p_riic_info->ch_no].B_Mode))
        {
            /* Sets the internal status. */
            riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt. */
            riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP);

        }
        else if (RIIC_MODE_S_READY == riic_api_info[p_riic_info->ch_no].B_Mode)
        {
            /* Initialize API status on RAM */
            riic_api_mode_event_init(priic_info_s[p_riic_info->ch_no], RIIC_MODE_S_READY);

