cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[p_riic_info->ch_no], RIIC_STS_AL);

            /* ---- Enables IIC bus interrupt enable register. ---- */
            if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enables slave send and slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_RX_SP_NAK);
            }
            else if (((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave send */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_TX_SP_NAK);
            }
            else if (((uint8_t *)FIT_NO_PTR == priic_info_s[p_riic_info->ch_no]->p_data1st)
                    && ((uint8_t *)FIT_NO_PTR != priic_info_s[p_riic_info->ch_no]->p_data2nd))
            {
                /* Enable slave receive */
                riic_int_icier_setting(priic_info_s[p_riic_info->ch_no], RIIC_ICIER_RX_SP);
            }
            else
            {
                /* Do Nothing */
            }
        }
        else
        {
            /* Do Nothing */
        }
    }

    /* slave transfer enable in now */
    else if ((RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* Do Nothing */
    }
    else
    {
        /* Do Nothing */
    }

    return RIIC_SUCCESS;
} /* End of function riic_arbitration_lost() */

/***********************************************************************************************************************
 * Function Name: riic_time_out
 * Description  : Time Out Error Processing.
 *                Generates the time out error and returns RIIC_TMO.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Arbitration lost error
 **********************************************************************************************************************/
static riic_return_t riic_time_out(riic_info_t * p_riic_info)
{
    /* Sets the internal status. */
    riic_api_status_set(p_riic_info, RIIC_STS_TMO);

    return RIIC_SUCCESS;
} /* End of function riic_time_out() */

/***********************************************************************************************************************
 * Function Name: riic_nack
 * Description  : Nack Error Processing.
 *                Generates the stop condition and returns RIIC_NACK.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation
 **********************************************************************************************************************/
static riic_return_t riic_nack(riic_info_t * p_riic_info)
{
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);
    volatile uint8_t         uctmp      = 0x00;

    /* Sets the internal status. */
    riic_api_status_set(p_riic_info, RIIC_STS_SP_COND_WAIT);

    if (RIIC_ICCR2_MST_SET == ((*piccr2_reg) & RIIC_ICCR2_MST))
    {
        /* Enables the IIC bus interrupt. */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP_AL);

        /* Generates the stop condition. */
        riic_stop_cond_generate(p_riic_info);
    }
    else
    {
        /* Enables the IIC bus interrupt. */
        riic_int_icier_setting(p_riic_info, RIIC_ICIER_SP);
    }

    /* Checks the internal mode. */
    if ((((RIIC_MODE_M_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode)
            || (RIIC_MODE_M_SEND_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
            || (RIIC_MODE_S_SEND == riic_api_info[p_riic_info->ch_no].N_Mode))
            || (RIIC_MODE_S_RECEIVE == riic_api_info[p_riic_info->ch_no].N_Mode))
    {
        /* Dummy Read */
        /* Refer to the RX User's Manual. */
        uctmp = riic_get_receiving_data(p_riic_info);
    }

    return RIIC_SUCCESS;
} /* End of function riic_nack() */

/***********************************************************************************************************************
 * Function Name: riic_enable_slave_transfer
 * Description  : Enable IIC Slave Transfer Processing.
 *                Enable the slave address match interrupt. Sets the internal status.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_SUCCESS                   ; Successful operation, idle state on enable slave transfer
 **********************************************************************************************************************/
static riic_return_t riic_enable_slave_transfer(riic_info_t * p_riic_info)
{
    /* Setting the IIC registers. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_slv_addr_match_int_enable(p_riic_info);

    /* Sets the internal status. */
    riic_api_status_set(p_riic_info, RIIC_STS_IDLE_EN_SLV);

    return RIIC_SUCCESS;
} /* End of function riic_enable_slave_transfer() */

/***********************************************************************************************************************
 * Function Name: riic_api_mode_event_init
 * Description  : Initializes RAM.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *              : riic_api_mode_t new_mode  ; New mode
 * Return Value : None
 **********************************************************************************************************************/
static void riic_api_mode_event_init(riic_info_t * p_riic_info, riic_api_mode_t new_mode)
{
    uint8_t ch_no = p_riic_info->ch_no;
    
    /* Clears the event flag. */
    riic_api_event[ch_no] = RIIC_EV_INIT;

    /* Sets the previous mode. */
    riic_api_info[ch_no].B_Mode = riic_api_info[ch_no].N_Mode;

    /* Sets the mode to RIIC_MODE_NONE. */
    riic_api_info[ch_no].N_Mode = new_mode;
} /* End of function riic_api_mode_event_init() */

