cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* Initializes ICFER register. */
    *picfer_reg = g_riic_icfer_init[p_riic_info->ch_no];
    uctmp = *picfer_reg; /* Reads ICFER. */

    /* Sets a transfer clock. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_set_frequency(p_riic_info); /* Sets ICMR1.CKS[2:0] bit, ICBRL and ICBRH registers. */

    /* Initializes ICMR2 registers. */
    *picmr2_reg = g_riic_icmr2_init[p_riic_info->ch_no];

    /* Disable interrupts each target MCU.  */
    riic_mcu_int_disable(p_riic_info->ch_no);

#ifdef TN_RXA012A
    riic_timeout_counter_clear(p_riic_info->ch_no);
#endif

} /* End of function riic_init_io_register() */

/***********************************************************************************************************************
 * Function Name: riic_slv_addr_match_int_enable
 * Description  : Enable Slave Address Match Interrupt Processing.
 *                Enables slave address match interrupt.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_slv_addr_match_int_enable(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const psarl0_reg = RIIC_SARL0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru0_reg = RIIC_SARU0_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl1_reg = RIIC_SARL1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru1_reg = RIIC_SARU1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psarl2_reg = RIIC_SARL2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const psaru2_reg = RIIC_SARU2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picser_reg = RIIC_ICSER_ADR(p_riic_info->ch_no);

    /* internal reset */
    riic_reset_set(p_riic_info);

    /* Enables slave address match interrupt. */
    if (1U == g_riic_slv_ad0_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl0_reg    = g_riic_slv_ad0_val[p_riic_info->ch_no] << 1;
        *psaru0_reg    = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR0E_SET;
    }
    else if (2U == g_riic_slv_ad0_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl0_reg = (uint8_t) (g_riic_slv_ad0_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru0_reg = (uint8_t) (((g_riic_slv_ad0_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR0E_SET;
    }
    else
    {
        /* Disable slave address0 */
        (*picser_reg) &= RIIC_ICSER_SAR0E_CLR;
    }

    if (1U == g_riic_slv_ad1_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl1_reg    = (uint8_t) (g_riic_slv_ad1_val[p_riic_info->ch_no] << 1);
        *psaru1_reg    = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR1E_SET;
    }
    else if (2U == g_riic_slv_ad1_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl1_reg = (uint8_t) (g_riic_slv_ad1_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru1_reg = (uint8_t) (((g_riic_slv_ad1_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR1E_SET;
    }
    else
    {
        /* Disable slave address1 */
        (*picser_reg) &= RIIC_ICSER_SAR1E_CLR;
    }

    if (1U == g_riic_slv_ad2_format[p_riic_info->ch_no])
    {
        /* 7bit address format setting */
        *psarl2_reg    = (uint8_t) (g_riic_slv_ad2_val[p_riic_info->ch_no] << 1);
        *psaru2_reg    = 0x00;
        (*picser_reg) |= RIIC_ICSER_SAR2E_SET;
    }
    else if (2 == g_riic_slv_ad2_format[p_riic_info->ch_no])
    {
        /* 10bit address format setting */
        *psarl2_reg = (uint8_t) (g_riic_slv_ad2_val[p_riic_info->ch_no] & RIIC_SARL_MASK);
        *psaru2_reg = (uint8_t) (((g_riic_slv_ad2_val[p_riic_info->ch_no] & RIIC_SARU_MASK) >> 7) |
        RIIC_SARU_10BIT_FORMAT_SET);
        (*picser_reg) |= RIIC_ICSER_SAR2E_SET;
    }
    else
    {
        /* Disable slave address2 */
        (*picser_reg) &= RIIC_ICSER_SAR2E_CLR;
    }

    if (1U == g_riic_gca_enable[p_riic_info->ch_no])
    {
        /* General call address setting */
        (*picser_reg) |= RIIC_ICSER_GCAE_SET;
    }
    else
    {
        /* Disable General call address */
        (*picser_reg) &= RIIC_ICSER_GCAE_CLR;
    }
    uctmp = *picser_reg; /* Reads ICSER. */

    /* Clears internal reset. */
    riic_reset_clear(p_riic_info);
} /* End of function riic_slv_addr_match_int_enable() */

/***********************************************************************************************************************
 * Function Name: riic_int_enable
 * Description  : Enable Interrupt Processing.
 *                Clears interrupt request register. Enables interrupt.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_enable(riic_info_t * p_riic_info)
{
    /* Clears the interrupt request register. */
    riic_clear_ir_flag(p_riic_info);

    /* Enable interrupts each target MCU.  */
    riic_mcu_int_enable(p_riic_info->ch_no);
} /* End of function riic_int_enable() */

/***********************************************************************************************************************
 * Function Name: riic_int_disable
 * Description  : Disable Interrupt Processing.
 *                Disables interrupt. Sets interrupt source priority. Clears interrupt request register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_disable(riic_info_t * p_riic_info)
{
    /* Disable interrupts each target MCU.  */
    riic_mcu_int_disable(p_riic_info->ch_no);

    /* Clears the interrupt request register. */
    /* Includes I/O register read operation at the end of the following function. */
    riic_clear_ir_flag(p_riic_info);
} /* End of function riic_int_disable() */

