cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_int_icier_setting
 * Description  : Set ICIER Register Processing.
 *                Sets an interrupt condition of RIIC.
 * Arguments    : riic_info_t *  p_riic_info     ; IIC Information
 : uint8_t        New_icier       ; New ICIER value
 * Return Value : None
 **********************************************************************************************************************/
static void riic_int_icier_setting(riic_info_t * p_riic_info, uint8_t New_icier)
{
    /* Setting TMOIE bit of interrupt enable register. */
    riic_mcu_int_icier_setting(p_riic_info->ch_no, New_icier);

} /* End of function riic_int_icier_setting() */

/***********************************************************************************************************************
 * Function Name: riic_set_frequency
 * Description  : Set IIC Frequency Processing. Sets ICMR1, ICBRL and ICBRH registers.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_set_frequency(riic_info_t * p_riic_info)
{
    riic_bps_calc(p_riic_info, g_riic_bps[p_riic_info->ch_no]); /* Set BPS */
} /* End of function riic_set_frequency() */

/***********************************************************************************************************************
 * Function Name: riic_check_bus_busy
 * Description  : Check Bus Busy Processing.
 *                When the bits of the RIIC registers are the following set values, the bus is released.
 *              :   ICCR2.BBSY = 0 ; The I2C bus is released (bus free state).
 *              :   ICCR1.SCLI = 1 ; SCLn pin input is at a high level.
 *              :   ICCR1.SDAI = 1 ; SDAn pin input is at a high level.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : RIIC_TRUE                      ; Bus ready
 *              : RIIC_FALSE                     ; Bus busy
 **********************************************************************************************************************/
static bool riic_check_bus_busy(riic_info_t * p_riic_info)
{
    volatile uint32_t cnt = 0x00000000;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Checks bus busy. */
    /* WAIT_LOOP */
    for (cnt = RIIC_CFG_BUS_CHECK_COUNTER; cnt > 0x00000000; cnt--)
    {
        /* Bus busy? */
        if ((RIIC_MSK_BBSY != ((*piccr2_reg) & RIIC_MSK_BBSY)) && /* ICCR2.BBSY = 0 */
        (RIIC_MSK_SCLSDA == ((*piccr1_reg) & RIIC_MSK_SCLSDA))) /* ICCR1.SCLI = 1, ICCR1.SDAI = 1 */
        {
            return RIIC_TRUE; /* Bus ready */
        }
    }
    return RIIC_FALSE; /* Bus busy */
} /* End of function riic_check_bus_busy() */

/***********************************************************************************************************************
 * Function Name: riic_start_cond_generate
 * Description  : Generate Start Condition Processing.
 *                Sets ICCR2.ST bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_start_cond_generate(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears start condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_START_SET) >> 2U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
    }

    /* Generates a start condition. */
    (*piccr2_reg) |= RIIC_ICCR2_ST; /* Sets ICCR2.ST bit. */
    uctmp          = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: riic_re_start_cond_generate
 * Description  : Generate Restart Condition Processing.
 *                Sets ICCR2.RS bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_re_start_cond_generate(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears start condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_START_SET) >> 2U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_START_CLR;
    }

    /* Generates a restart condition. */
    (*piccr2_reg) |= RIIC_ICCR2_RS; /* Sets ICCR2.RS bit. */
    uctmp          = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_re_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: riic_stop_cond_generate
 * Description  : Generate Stop Condition Processing.
 *                Clears ICSR2.STOP bit and sets ICCR2.SP bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_stop_cond_generate(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picsr2_reg = RIIC_ICSR2_ADR(p_riic_info->ch_no);
    volatile uint8_t * const piccr2_reg = RIIC_ICCR2_ADR(p_riic_info->ch_no);

    /* Clears stop condition detection flag. */
    if (0x00 != (((*picsr2_reg) & RIIC_ICSR2_STOP_SET) >> 3U))
    {
        (*picsr2_reg) &= RIIC_ICSR2_STOP_CLR;
    }

    /* Generates a stop condition. */
    (*piccr2_reg) |= RIIC_ICCR2_SP; /* Sets ICCR2.SP bit. */
    uctmp          = *piccr2_reg; /* Reads ICCR2. */
} /* End of function riic_stop_cond_generate() */

