cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
/***********************************************************************************************************************
 * Function Name: riic_set_sending_data
 * Description  : Transmit Data Processing.
 *                Sets transmission data to ICDRT register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 *              : uint8_t *p_data                ; Transmitted data buffer pointer
 * Return Value : None
 **********************************************************************************************************************/
static void riic_set_sending_data(riic_info_t * p_riic_info, uint8_t *p_data)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picdrt_reg = RIIC_ICDRT_ADR(p_riic_info->ch_no);

    /* Clears TXI interrupt request register. */
    /* For the measure to keep the IR flag for the TXI interrupt from stocking twice,               */
    /* when the IR flag is 1 before writing data to the data buffer in the TXI interrupt handling,  */
    /* the IR flag is cleared before transmission.                                                  */
    /* This issue happens, for example, when the following three all occur.                         */
    /*  - An AL occurred during MasterSend.                                                         */
    /*  - In the communication with an AL occurred, the RX device is specified with SlaveSend       */
    /*    by the communication target Master.                                                       */
    /*  - The TXI interrupt handling is in wait state after receiving the address due to            */
    /*    another interrupt execution, etc.                                                         */
    riic_mcu_clear_ir_txi(p_riic_info->ch_no);

    /* Sets the transmitting data. */
    *picdrt_reg = *p_data; /* Writes data to RIIC in order to transmit. */
    uctmp       = *picdrt_reg; /* Reads ICDRT. */
} /* End of function riic_set_sending_data() */

/***********************************************************************************************************************
 * Function Name: riic_get_receiving_data
 * Description  : Receive Data Prpcessing.
 *                Stores received data from ICDRR register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : Returns received data.
 **********************************************************************************************************************/
static uint8_t riic_get_receiving_data(riic_info_t * p_riic_info)
{
    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picdrr_reg = RIIC_ICDRR_ADR(p_riic_info->ch_no);

    /* Stores the received data. */
    return *picdrr_reg;
} /* End of function riic_get_receiving_data() */

/***********************************************************************************************************************
 * Function Name: riic_receive_wait_setting
 * Description  : Receive "last byte - 2bytes" Setting Proccesing.
 *                Sets ICMR3.WAIT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_wait_setting(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.WAIT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_WAIT_SET;
    uctmp          = *picmr3_reg; /* Reads ICMR3. */
} /* End of function riic_receive_wait_setting() */

/***********************************************************************************************************************
 * Function Name: riic_receive_pre_end_setting
 * Description  : Receive "last byte - 1byte" Setting Proccesing.
 *                Sets ICMR3.RDRFS bit and ACKBT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_pre_end_setting(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.RDRFS bit.*/
    (*picmr3_reg) |= RIIC_ICMR3_RDRFS_SET;

    /* Sets ICMR3.ACKBT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKWP_SET; /* Modification of the ACKBT bit is enabled.                */
    (*picmr3_reg) |= RIIC_ICMR3_ACKBT_SET; /* A 1 is sent as the acknowledge bit (NACK transmission).  */
    (*picmr3_reg) &= RIIC_ICMR3_ACKWP_CLR; /* Modification of the ACKBT bit is disabled.               */
    uctmp          = *picmr3_reg; /* Reads ICMR3.                                             */
} /* End of function riic_receive_pre_end_setting() */

/***********************************************************************************************************************
 * Function Name: riic_receive_end_setting
 * Description  : Receive End Setting Processing.
 *                Sets ICMR3.ACKBT bit and clears ICMR3.WAIT bit.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_receive_end_setting(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);

    /* Sets ICMR3.ACKBT bit. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKWP_SET; /* Modification of the ACKBT bit is enabled. */
    (*picmr3_reg) |= RIIC_ICMR3_ACKBT_SET;
    (*picmr3_reg) &= RIIC_ICMR3_ACKWP_CLR; /* Modification of the ACKBT bit is disabled. */

