cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    /* Clears ICMR3.WAIT bit. */
    (*picmr3_reg) &= RIIC_ICMR3_WAIT_CLR;
    uctmp          = *picmr3_reg; /* Reads ICMR3. */
} /* End of function riic_receive_end_setting() */

/***********************************************************************************************************************
 * Function Name: riic_reset_clear
 * Description  : Enable IIC Function Processing.
 *                Enables RIIC communication and enables RIIC multi-function pin controller.
 * Arguments    : riic_info_t * p_riic_info     ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_reset_clear(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

    /* Enables RIIC. */
    (*piccr1_reg) &= RIIC_ICCR1_ENABLE; /* Clears ICCR1.IICRST bit. */
    uctmp          = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_reset_clear() */

/***********************************************************************************************************************
 * Function Name: riic_reset_set
 * Description  : Disable IIC Function Processing.
 *                Disables RIIC communication and disables RIIC multi-function pin controller.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_reset_set(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

    /* Resets RIIC registers. */
    (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET; /* Sets ICCR1.IICRST bit. */
    uctmp          = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_reset_set() */

/***********************************************************************************************************************
 * Function Name: riic_all_reset
 * Description  : All reset IIC Function Processing.
 *                Resets all registers and internal states of the RIIC.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_all_reset(riic_info_t * p_riic_info)
{
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);

    /* Resets RIIC registers. */
    (*piccr1_reg) &= RIIC_ICCR1_ICE_CLR; /* Clears ICCR1.ICE bit to 0. */
    (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET; /* Sets ICCR1.IICRST bit to 1. */

    uctmp = *piccr1_reg; /* Reads ICCR1. */
} /* End of function riic_all_reset() */

/***********************************************************************************************************************
 * Function Name: riic_clear_ir_flag
 * Description  : Clears Interrupt Request Flag Processing.
 *                Clears interrupt request register.
 * Arguments    : riic_info_t * p_riic_info      ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void riic_clear_ir_flag(riic_info_t * p_riic_info)
{
    uint8_t internal_flag = 0x00; /* Determines whether reinitialization is necessary. */
    volatile uint8_t uctmp = 0x00;

    /* Creates the register pointer for the specified RIIC channel. */
    volatile uint8_t * const piccr1_reg = RIIC_ICCR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picier_reg = RIIC_ICIER_ADR(p_riic_info->ch_no);

    /* Checks IR flag. */
    /* If IR flag is set, clears IR flag. */
    if ((RIIC_IR_SET == riic_mcu_check_ir_txi(p_riic_info->ch_no))
            || (RIIC_IR_SET == riic_mcu_check_ir_rxi(p_riic_info->ch_no)))
    {
        /* Checks ICCR1.ICE bit. */
        if (RIIC_ICCR1_ICE_SET == ((*piccr1_reg) & RIIC_ICCR1_ICE)) /* ICCR1.ICE = 1 */
        {
            /* Sets return value. */
            internal_flag = 0x01;

            /* Clears ICCR1.ICE bit and sets ICCR1.IICRST bit. */
            (*piccr1_reg) |= RIIC_ICCR1_RIIC_RESET;

            /* WAIT_LOOP */
            while (RIIC_ICCR1_RIIC_RESET != ((*piccr1_reg) & RIIC_ICCR1_RIIC_RESET))
            {
                /* Do Nothing */
            }
            (*piccr1_reg) &= RIIC_ICCR1_ICE_CLR;

            /* WAIT_LOOP */
            while (RIIC_ICCR1_NOT_DRIVEN != ((*piccr1_reg) & RIIC_ICCR1_ICE))
            {
                /* Do Nothing */
            }
        }

        /* Initializes ICIER register. */
        *picier_reg = RIIC_ICIER_INIT;

        /* WAIT_LOOP */
        while (RIIC_ICIER_INIT != (*picier_reg))
        {
            /* Do Nothing */
        }

        riic_mcu_clear_ir_rxi(p_riic_info->ch_no); /* Clears RXI interrupt request register. */
        riic_mcu_clear_ir_txi(p_riic_info->ch_no); /* Clears TXI interrupt request register. */

        /* Checks the need of the reinitialization. */
        if (0x01 == internal_flag)
        {
            internal_flag = 0x00;

            /* Reinitializes RIIC register because cleared ICCR1.ICE bit. */
            /* Includes I/O register read operation at the end of the following function. */
            riic_init_io_register(p_riic_info);
        }
    }
} /* End of function riic_clear_ir_flag() */

/***********************************************************************************************************************
 * Function Name: riic_bps_calc
 * Description  : Calculation for ICBRH and ICBRL registers value
 *              :  and CKS bits value from setting bps of the argument.
 *              :
 * Arguments    : riic_info_t * p_riic_info      ; IIC Informationu
 *              : uint16_t kbps                  ; bit rate(kHz)
 * Return Value : RIIC_SUCCESS                   ; Successful operation, communication state
 *              : RIIC_ERR_OTHER                 ; Other error
 **********************************************************************************************************************/
static riic_return_t riic_bps_calc(riic_info_t * p_riic_info, uint16_t kbps)
{
    volatile uint8_t uctmp;

