cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    volatile uint8_t * const picmr1_reg = RIIC_ICMR1_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picmr3_reg = RIIC_ICMR3_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picbrl_reg = RIIC_ICBRL_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picbrh_reg = RIIC_ICBRH_ADR(p_riic_info->ch_no);
    volatile uint8_t * const picfer_reg = RIIC_ICFER_ADR(p_riic_info->ch_no);
    
    uint8_t uctmp_tmp;

    const uint8_t d_cks[RIIC_MAX_DIV] =
    { 1, 2, 4, 8, 16, 32, 64, 128 }; /* divider array of RIIC clock  */
    double pclk_val;

    volatile double bps = (double) (kbps * 1000);
    volatile double L_time; /* H Width period */
    volatile double H_time; /* L Width period */
    
    double bps_tmp;

    volatile double calc_val; /* Using for calculation buffer */
    
    double calc_val_tmp;

    double scl_up_time;
    double scl_down_time;

    volatile uint8_t cnt;
    uint8_t          nf_replace;

    pclk_val = riic_mcu_check_freq(); /* Store pclk frequency */
    
    /* Set Rise up time and down time */
    if (kbps > RIIC_FAST_SPPED_MAX)
    {
        /* When bps more than 400Kbps[Fast mode plus] */
        scl_up_time   = RIIC_CFG_SCL1M_UP_TIME;
        scl_down_time = RIIC_CFG_SCL1M_DOWN_TIME;
    }
    else if (kbps > RIIC_STAD_SPPED_MAX)
    {
        /* When bps more than 100Kbps[Fast mode] */
        scl_up_time   = RIIC_CFG_SCL400K_UP_TIME;
        scl_down_time = RIIC_CFG_SCL400K_DOWN_TIME;
    }
    else
    {
        /* When bps less than 100Kbps[Standard mode] */
        scl_up_time   = RIIC_CFG_SCL100K_UP_TIME;
        scl_down_time = RIIC_CFG_SCL100K_DOWN_TIME;
    }

    /* Calculation for ICBRH and ICBRL registers value */

    /* Calculation L width time */
    L_time = (1 / (2 * bps)); /* Harf period of frequency */
    H_time = L_time;

    /* Check I2C mode of Speed */
    if (kbps > RIIC_FAST_SPPED_MAX)
    {
        /* 400kbps over */
        /* Check L width */
        if (L_time <= (0.5E-6 + scl_down_time))
        {
            /* Wnen L width less than 0.5us */
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time  = 0.5E-6;
            bps_tmp = bps;
            H_time  = (((1 / bps_tmp) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time -= scl_down_time;
            H_time -= scl_up_time;
        }
    }
    else if (kbps > RIIC_STAD_SPPED_MAX)
    {
        /* 100kbps over */
        /* Check L width */
        if (L_time <= (1.3E-6 + scl_down_time))
        {
            /* Wnen L width less than 1.3us */
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time  = 1.3E-6;
            bps_tmp = bps;
            H_time  = (((1 / bps_tmp) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
            /* Subtract Rise up and down time for SCL from H/L width */
            L_time -= scl_down_time;
            H_time -= scl_up_time;
        }
    }
    else
    {
        /* less than 100kbps */
/* Since the L width is calculated based on the half period of frequency above, it is always larger than 4.7 us
   at 100 kbps or less. Comment out the following branch processing.
         * Check L width *
        if (L_time < 4.7E-6)
        {
            * Wnen L width less than 4.7us *
            * Subtract Rise up and down time for SCL from H/L width *
            L_time = 4.7E-6;
            H_time = (((1 / bps) - L_time) - scl_up_time) - scl_down_time;
        }
        else
        {
 */
        /* Subtract Rise up and down time for SCL from H/L width */
        L_time -= scl_down_time;
        H_time -= scl_up_time;

/*      }*/
    }

    /*************** Calculation ICBRL value ***********************/
    /* Calculating until calc_val is less than 32 */
    /* WAIT_LOOP */
    for (calc_val = 0xFF, cnt = 0; RIIC_ICBR_MAX < calc_val; cnt++)
    {
        calc_val = L_time; /* Set L width time */

        /* Check the range of divider of CKS */
        if (cnt >= RIIC_MAX_DIV)
        {
            /* Cannot set bps */
            return RIIC_ERR_OTHER;
        }

        calc_val_tmp = calc_val;
        calc_val     = (calc_val_tmp / (d_cks[cnt] / pclk_val));/* Calculattion ICBRL value */
        calc_val     = calc_val + 0.5; /* round off */
    }

    /* store ICMR1 value to avoid CKS bit. */
    uctmp     = (uint8_t) ((uint8_t) (*picmr1_reg) & (((~BIT4) & (~BIT5)) & (~BIT6)));
    uctmp_tmp = uctmp;

    *picmr1_reg = (uint8_t) ((uctmp_tmp) | ((cnt - 1) << 4)); /* Set ICMR1.CKS bits.*/

    /* Apply noise filter stage  */
    nf_replace = ((*picmr3_reg) & (0x03)) + 1;

    /* Check if digital noise filter circuit is used */
    if (((*picfer_reg) & BIT5) == BIT5)
    {
        if ((0 < nf_replace) && (((nf_replace + 1) * 2) > calc_val))
        {
            calc_val = (nf_replace + 1) * 2;
        }

        /* Set value to ICBRL register */
        *picbrl_reg = (uint8_t) ((((uint8_t) ((calc_val - 1) - nf_replace) | BIT7) | BIT6) | BIT5);
    }
    else
    {
        /* Set value to ICBRL register */
        *picbrl_reg = (uint8_t) ((((uint8_t) (calc_val - 1) | BIT7) | BIT6) | BIT5);
    }

    /*************** Calculation ICBRH value ***********************/
    calc_val     = H_time; /* Set H width */
    calc_val_tmp = calc_val;
    calc_val     = (calc_val_tmp / (d_cks[cnt - 1] / pclk_val)); /* Calculattion ICBRH value */
    calc_val     = (uint8_t) (calc_val + 0.5); /* round off */

    /* If the calculated value is less than 1, it rounded up to 1. */
    if (1 > calc_val)
    {
        calc_val = 1;
    }

    /* Check if digital noise filter circuit is used */
    if (((*picfer_reg) & BIT5) == BIT5)
    {
        if ((0 < nf_replace) && (((nf_replace + 1) * 2) > calc_val))
        {
            calc_val = (nf_replace + 1) * 2;
        }

        /* Set value to ICBRH register */
        *picbrh_reg = (uint8_t) ((((uint8_t) ((calc_val - 1) - nf_replace) | BIT7) | BIT6) | BIT5);
    }
    else
    {
        /* Set value to ICBRH register */
        *picbrh_reg = (uint8_t) ((((uint8_t) (calc_val - 1) | BIT7) | BIT6) | BIT5);
    }
    uctmp = *picbrh_reg; /* dummy read */

