cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
    return RIIC_SUCCESS;

} /* End of function riic_bps_calc() */

#if (RIIC_CFG_CH0_INCLUDED == 1U)
/***********************************************************************************************************************
 * Function Name: riic0_eei_sub
 * Description  : Interrupt EEI handler for channel 0.
 *                Types of interrupt requests transfer error or event generation.
 *                The event generations are arbitration-lost, NACK detection, timeout detection, 
 *                start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic0_eei_sub(void)
{
    riic_info_t * p_riic_info;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(0);
    #endif

    /* Checks Time Out. */
    if ((0U != RIIC0.ICSR2.BIT.TMOF) && (0U != RIIC0.ICIER.BIT.TMOIE))
    {
        /* all interrupt disable */
        RIIC0.ICIER.BIT.TMOIE = 0U;

        /* WAIT_LOOP */
        while (0U != RIIC0.ICIER.BIT.TMOIE)
        {
            /* Do Nothing */
        }
        riic_api_event[0] = RIIC_EV_INT_TMO;
    }

    /* Checks Arbitration Lost. */
    if ((0U != RIIC0.ICSR2.BIT.AL) && (0U != RIIC0.ICIER.BIT.ALIE))
    {
        RIIC0.ICIER.BIT.ALIE = 0U;

        /* WAIT_LOOP */
        while (0U != RIIC0.ICIER.BIT.ALIE)
        {
            /* Do Nothing */
        }
        riic_api_event[0] = RIIC_EV_INT_AL;
        if (RIIC_MODE_S_READY == riic_api_info[0].B_Mode)
        {
            riic_set_ch_status(priic_info_s[0], RIIC_COMMUNICATION);
        }
    }

    /* Checks stop condition detection. */
    if ((0U != RIIC0.ICSR2.BIT.STOP) && (0U != RIIC0.ICIER.BIT.SPIE))
    {
        if (((RIIC_MODE_S_READY == riic_api_info[0].N_Mode) || (RIIC_MODE_S_SEND == riic_api_info[0].N_Mode))
                || (RIIC_MODE_S_RECEIVE == riic_api_info[0].N_Mode))
        {
            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[0], RIIC_STS_SP_COND_WAIT);
        }

        /* Prohibits STOP interrupt. */
        RIIC0.ICIER.BIT.SPIE = 0U;

        RIIC0.ICMR3.BIT.RDRFS = 0U; /* Refer to the technical update. */
        RIIC0.ICMR3.BIT.ACKWP = 1U; /* Refer to the technical update. */
        RIIC0.ICMR3.BIT.ACKBT = 0U; /* Refer to the technical update. */
        RIIC0.ICMR3.BIT.ACKWP = 0U; /* Refer to the technical update. */

        /* WAIT_LOOP */
        while ((0U != RIIC0.ICMR3.BIT.RDRFS) || (0U != RIIC0.ICMR3.BIT.ACKBT))
        {
            /* Do Nothing */
        }

        /* Clears each status flag. */
        RIIC0.ICSR2.BIT.STOP = 0U;

        /* WAIT_LOOP */
        while (0U != RIIC0.ICSR2.BIT.STOP)
        {
            /* Do Nothing */
        }

        /* Sets event flag. */
        riic_api_event[0] = RIIC_EV_INT_STOP;
    }

    /* Checks NACK reception. */
    if ((0U != RIIC0.ICSR2.BIT.NACKF) && (0U != RIIC0.ICIER.BIT.NAKIE))
    {
        /* Prohibits NACK interrupt to generate stop condition. */
        RIIC0.ICIER.BIT.NAKIE = 0U;

        /* Prohibits these interrupt. */
        /* After NACK interrupt, these interrupts will occur when they do not stop the following interrupts. */
        RIIC0.ICIER.BIT.TEIE = 0U;
        RIIC0.ICIER.BIT.TIE  = 0U;
        RIIC0.ICIER.BIT.RIE  = 0U;

        /* WAIT_LOOP */
        while (((0U != RIIC0.ICIER.BIT.TEIE) || (0U != RIIC0.ICIER.BIT.TIE)) || (0U != RIIC0.ICIER.BIT.RIE))
        {
            /* Do Nothing */
        }

        if (0U == RIIC0.ICCR2.BIT.TRS)
        {
            riic_mcu_clear_ir_rxi(0);
        }

        /* Sets event flag. */
        riic_api_event[0] = RIIC_EV_INT_NACK;
    }

    /* Checks start condition detection. */
    if ((0U != RIIC0.ICSR2.BIT.START) && (0U != RIIC0.ICIER.BIT.STIE))
    {
        /* Disable start condition detection interrupt. */
        /* Clears status flag. */
        RIIC0.ICIER.BIT.STIE  = 0U;
        RIIC0.ICSR2.BIT.START = 0U;

        /* WAIT_LOOP */
        while ((0U != RIIC0.ICSR2.BIT.START) || (0U != RIIC0.ICIER.BIT.STIE))
        {
            /* Do Nothing */
        }

        /* Sets event flag. */
        riic_api_event[0] = RIIC_EV_INT_START;
    }

    switch (riic_api_info[0].N_Mode)
    {
        case RIIC_MODE_M_SEND :
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[0];
            break;

        case RIIC_MODE_S_READY :
        case RIIC_MODE_S_SEND :
        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[0];
            break;

        default :

            /* Internal error */
            return;
            break;
    }

    r_riic_advance(p_riic_info); /* Calls advance function */
} /* End of function riic0_eei_sub() */

/***********************************************************************************************************************
 * Function Name: riic0_txi_sub
 * Description  : Interrupt TXI handler for channel 0.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic0_txi_sub(void)
{
    uint8_t tmp;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(0);
    #endif

    /* TXI processing is performed only when the following conditions are all met.                 */
    /*  - The address part of data has been received and the received address matches the RX's     */
    /*    own address.                                                                             */
    /*  - The RX device is in slave mode.                                                          */
    /*  - The RX device is in transmission mode (the R/W bit received is 'R' (slave transmission)) */
    tmp = RIIC0.ICCR2.BYTE;
    if ((RIIC_ICCR2_MST_SET != (tmp & RIIC_ICCR2_MST)) && (RIIC_ICCR2_TRS_SET == (tmp & RIIC_ICCR2_TRS)))
    {
        /* Processing when the addresses match (slave send specified) */

        /* Determines whether the state is arbitration-lost detected.                           */
        /* When an arbitration-lost is detected, the riic_after_receive_slvadr function is not  */
        /* executed. Thus the internal status needs to be changed to "RIIC_STS_SEND_DATA_WAIT". */
        if (RIIC_STS_AL == riic_api_info[0].N_status)
        {
            /* Processing when an arbitration-lost is detected. */
            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[0], RIIC_STS_SEND_DATA_WAIT);
        }

        /* Determines if the slave transmission is the first slave transmission.             */
        /* N_mode is updated from "RIIC_MODE_S_READY" to "RIIC_MODE_S_SEND" on the first TXI */
        /* interrupt after the slave transmission is determined.                             */
        if (RIIC_MODE_S_READY == riic_api_info[0].N_Mode)
        {
            /* Processing for the first slave transmission */
            /* Sets the internal mode. */
            riic_api_info[0].N_Mode = RIIC_MODE_S_SEND; /* Set slave transmission mode. */
        }

