cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
        /* Sets event. */
        switch (riic_api_info[0].N_status)
        {
            case RIIC_STS_IDLE_EN_SLV :

                /* Updates the channel status. */
                riic_set_ch_status(priic_info_s[0], RIIC_COMMUNICATION);

                /* Sets interrupted address sending. */
                riic_api_event[0] = RIIC_EV_INT_ADD;

                break;

            case RIIC_STS_SEND_DATA_WAIT :

                /* Sets interrupted data sending. */
                riic_api_event[0] = RIIC_EV_INT_SEND;

                break;

            default :

                /* Does nothing. */
                break;

        }

        r_riic_advance(priic_info_s[0]); /* Calls advance function */

    }
} /* End of function riic0_txi_sub() */

/***********************************************************************************************************************
 * Function Name: riic0_rxi_sub
 * Description  : Interrupt RXI handler for channel 0.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic0_rxi_sub(void)
{
    riic_info_t * p_riic_info;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(0);
    #endif

    if (RIIC_STS_AL == riic_api_info[0].N_status)
    {
        /* Sets the internal status. */
        riic_api_status_set(priic_info_s[0], RIIC_STS_IDLE_EN_SLV);
    }

    if (RIIC_MODE_S_READY == riic_api_info[0].N_Mode)
    {
        /* Sets the internal mode. */
        riic_api_info[0].N_Mode = RIIC_MODE_S_RECEIVE;
    }

    if ((RIIC_STS_IDLE_EN_SLV == riic_api_info[0].N_status))
    {
        /* Updates the channel status. */
        riic_set_ch_status(priic_info_s[0], RIIC_COMMUNICATION);
    }

    switch (riic_api_info[0].N_Mode)
    {
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[0];
            break;

        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[0];
            break;

        default :

            /* Internal error */
            return;
            break;
    }

    /* Sets interrupted data receiving. */
    riic_api_event[0] = RIIC_EV_INT_RECEIVE;

    r_riic_advance(p_riic_info); /* Calls advance function */
} /* End of function riic0_rxi_sub() */

/***********************************************************************************************************************
 * Function Name: riic0_tei_sub
 * Description  : Interrupt TEI handler for channel 0.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic0_tei_sub(void)
{
    #ifdef TN_RXA012A
    riic_timeout_counter_clear(0);
    #endif

    /* Clears ICSR2.TEND. */
    RIIC0.ICSR2.BIT.TEND = 0U;

    /* WAIT_LOOP */
    while (0U != RIIC0.ICSR2.BIT.TEND)
    {
        /* Do Nothing */
    }

    /* Sets event. */
    switch (riic_api_info[0].N_status)
    {
        case RIIC_STS_SEND_SLVADR_W_WAIT :
        case RIIC_STS_SEND_SLVADR_R_WAIT :

            /* Sets interrupted address sending. */
            riic_api_event[0] = RIIC_EV_INT_ADD;

            break;

        case RIIC_STS_SEND_DATA_WAIT :

            /* Sets interrupted data sending. */
            riic_api_event[0] = RIIC_EV_INT_SEND;

            break;

        default :

            /* Does nothing. */
            break;

    }

    r_riic_advance(priic_info_m[0]); /* Calls advance function */
} /* End of function riic0_tei_sub() */
#endif

#if (RIIC_CFG_CH1_INCLUDED == 1U)
/***********************************************************************************************************************
 * Function Name: riic1_eei_sub
 * Description  : Interrupt EEI handler for channel 1.
 *                Types of interrupt requests transfer error or event generation.
 *                The event generations are arbitration-lost, NACK detection, timeout detection, 
 *                start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic1_eei_sub (void)
{
    riic_info_t * p_riic_info;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(1);
    #endif

    /* Checks Time Out. */
    if ((0U != RIIC1.ICSR2.BIT.TMOF) && (0U != RIIC1.ICIER.BIT.TMOIE))
    {
        /* all interrupt disable */
        RIIC1.ICIER.BIT.TMOIE = 0U;
        /* WAIT_LOOP */
        while (0U != RIIC1.ICIER.BIT.TMOIE)
        {
            /* Do Nothing */
        }
        riic_api_event[1] = RIIC_EV_INT_TMO;
    }

    /* Checks Arbitration Lost. */
    if ((0U != RIIC1.ICSR2.BIT.AL) && (0U != RIIC1.ICIER.BIT.ALIE))
    {
        RIIC1.ICIER.BIT.ALIE = 0U;
        /* WAIT_LOOP */
        while (0U != RIIC1.ICIER.BIT.ALIE)
        {
            /* Do Nothing */
        }
        riic_api_event[1] = RIIC_EV_INT_AL;
        if (RIIC_MODE_S_READY == riic_api_info[1].B_Mode)
        {
            riic_set_ch_status(priic_info_s[1], RIIC_COMMUNICATION);
        }
    }

    /* Checks stop condition detection. */
    if ((0U != RIIC1.ICSR2.BIT.STOP) && (0U != RIIC1.ICIER.BIT.SPIE))
    {
        if (((RIIC_MODE_S_READY == riic_api_info[1].N_Mode) || (RIIC_MODE_S_SEND == riic_api_info[1].N_Mode))
                || (RIIC_MODE_S_RECEIVE == riic_api_info[1].N_Mode))
        {
            /* Sets the internal status. */
            riic_api_status_set(priic_info_s[1], RIIC_STS_SP_COND_WAIT);
        }

        /* Prohibits STOP interrupt. */
        RIIC1.ICIER.BIT.SPIE = 0U;

        RIIC1.ICMR3.BIT.RDRFS = 0U; /* Refer to the technical update. */
        RIIC1.ICMR3.BIT.ACKWP = 1U; /* Refer to the technical update. */
        RIIC1.ICMR3.BIT.ACKBT = 0U; /* Refer to the technical update. */
        RIIC1.ICMR3.BIT.ACKWP = 0U; /* Refer to the technical update. */
        /* WAIT_LOOP */
        while ((0U != RIIC1.ICMR3.BIT.RDRFS) || (0U != RIIC1.ICMR3.BIT.ACKBT))
        {
            /* Do Nothing */
        }

        /* Clears each status flag. */
        RIIC1.ICSR2.BIT.STOP = 0U;
        /* WAIT_LOOP */
        while (0U != RIIC1.ICSR2.BIT.STOP)
        {
            /* Do Nothing */
        }

        /* Sets event flag. */
        riic_api_event[1] = RIIC_EV_INT_STOP;
    }

    /* Checks NACK reception. */
    if ((0U != RIIC1.ICSR2.BIT.NACKF) && (0U != RIIC1.ICIER.BIT.NAKIE))
    {
        /* Prohibits NACK interrupt to generate stop condition. */
        RIIC1.ICIER.BIT.NAKIE = 0U;

        /* Prohibits these interrupt. */
        /* After NACK interrupt, these interrupts will occur when they do not stop the following interrupts. */
        RIIC1.ICIER.BIT.TEIE = 0U;
        RIIC1.ICIER.BIT.TIE = 0U;
        RIIC1.ICIER.BIT.RIE = 0U;
        /* WAIT_LOOP */
        while (((0U != RIIC1.ICIER.BIT.TEIE) || (0U != RIIC1.ICIER.BIT.TIE)) || (0U != RIIC1.ICIER.BIT.RIE) )
        {
            /* Do Nothing */
        }

        if (0U == RIIC1.ICCR2.BIT.TRS)
        {
            riic_mcu_clear_ir_rxi(1);
        }

        /* Sets event flag. */
        riic_api_event[1] = RIIC_EV_INT_NACK;
    }

    /* Checks start condition detection. */
    if ((0U != RIIC1.ICSR2.BIT.START) && (0U != RIIC1.ICIER.BIT.STIE))
    {
        /* Disable start condition detection interrupt. */
        /* Clears status flag. */
        RIIC1.ICIER.BIT.STIE = 0U;
        RIIC1.ICSR2.BIT.START = 0U;
        /* WAIT_LOOP */
        while ((0U != RIIC1.ICSR2.BIT.START) || (0U != RIIC1.ICIER.BIT.STIE))
        {
            /* Do Nothing */
        }

        /* Sets event flag. */
        riic_api_event[1] = RIIC_EV_INT_START;
    }

    switch (riic_api_info[1].N_Mode)
    {
        case RIIC_MODE_M_SEND :
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[1];
        break;

        case RIIC_MODE_S_READY :
        case RIIC_MODE_S_SEND :
        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[1];
        break;

        default :

