cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx.c
        /* Sets event. */
        switch (riic_api_info[2].N_status)
        {
            case RIIC_STS_IDLE_EN_SLV :

                /* Updates the channel status. */
                riic_set_ch_status(priic_info_s[2], RIIC_COMMUNICATION);

                /* Sets interrupted address sending. */
                riic_api_event[2] = RIIC_EV_INT_ADD;

            break;

            case RIIC_STS_SEND_DATA_WAIT :

                /* Sets interrupted data sending. */
                riic_api_event[2] = RIIC_EV_INT_SEND;

            break;

            default :

                /* Does nothing. */
            break;

        }

        r_riic_advance(priic_info_s[2]); /* Calls advance function */

    }
} /* End of function riic2_txi_sub() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic2_rxi_sub
 * Description  : Interrupt RXI handler for channel 2.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_rxi_sub (void)
{
    riic_info_t * p_riic_info;

    #ifdef TN_RXA012A
    riic_timeout_counter_clear(2);
    #endif

    if (RIIC_STS_AL == riic_api_info[2].N_status)
    {
        /* Sets the internal status. */
        riic_api_status_set(priic_info_s[2], RIIC_STS_IDLE_EN_SLV);
    }

    if (RIIC_MODE_S_READY == riic_api_info[2].N_Mode)
    {
        /* Sets the internal mode. */
        riic_api_info[2].N_Mode = RIIC_MODE_S_RECEIVE;
    }

    if ((RIIC_STS_IDLE_EN_SLV == riic_api_info[2].N_status))
    {
        /* Updates the channel status. */
        riic_set_ch_status(priic_info_s[2], RIIC_COMMUNICATION);
    }

    switch (riic_api_info[2].N_Mode)
    {
        case RIIC_MODE_M_RECEIVE :
        case RIIC_MODE_M_SEND_RECEIVE :

            /* Master mode data */
            p_riic_info = priic_info_m[2];
        break;

        case RIIC_MODE_S_RECEIVE :

            /* Slave mode data */
            p_riic_info = priic_info_s[2];
        break;

        default :

            /* Internal error */
            return;
        break;
    }

    /* Sets interrupted data receiving. */
    riic_api_event[2] = RIIC_EV_INT_RECEIVE;

    r_riic_advance(p_riic_info); /* Calls advance function */
} /* End of function riic2_rxi_sub() */

/***********************************************************************************************************************
 * Outline      : 
 * Function Name: riic2_tei_sub
 * Description  : Interrupt TEI handler for channel 2.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_tei_sub (void)
{
    #ifdef TN_RXA012A
    riic_timeout_counter_clear(2);
    #endif

    /* Clears ICSR2.TEND. */
    RIIC2.ICSR2.BIT.TEND = 0U;
    /* WAIT_LOOP */
    while (0U != RIIC2.ICSR2.BIT.TEND)
    {
        /* Do Nothing */
    }

    /* Sets event. */
    switch (riic_api_info[2].N_status)
    {
        case RIIC_STS_SEND_SLVADR_W_WAIT :
        case RIIC_STS_SEND_SLVADR_R_WAIT :

            /* Sets interrupted address sending. */
            riic_api_event[2] = RIIC_EV_INT_ADD;

        break;

        case RIIC_STS_SEND_DATA_WAIT :

            /* Sets interrupted data sending. */
            riic_api_event[2] = RIIC_EV_INT_SEND;

        break;

        default :

            /* Does nothing. */
        break;

    }

    r_riic_advance(priic_info_m[2]); /* Calls advance function */
} /* End of function riic2_tei_sub() */
#endif

/***********************************************************************************************************************
 * Function Name: riic_timeout_counter_clear
 * Description  : Technical update No.TN-RX*-A012A process.
 *                Time out internal counter clear.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
#ifdef TN_RXA012A
static void riic_timeout_counter_clear (uint8_t channel)
{
    volatile uint8_t * const picmr2_reg = RIIC_ICMR2_ADR(channel);
    volatile uint8_t * const ptmocntl_reg = RIIC_TMOCNTL_ADR(channel);
    volatile uint8_t * const ptmocnth_reg = RIIC_TMOCNTH_ADR(channel);

    /* time out internal counter write enable */
    (*picmr2_reg) |= RIIC_ICMR2_TMWE_SET;
    if (RIIC_ICMR2_TMWE == ((*picmr2_reg) & RIIC_ICMR2_TMWE))
    {
        /* Do Nothing */
    }

    /* time out iternal counter clear */
    (*ptmocntl_reg) = 0x00;
    (*ptmocnth_reg) = 0x00;
    if (0xFF == (*ptmocnth_reg))
    {
        /* Do Nothing */
    }

    /* time out internal counter write disable */
    (*picmr2_reg) &= RIIC_ICMR2_TMWE_CLR;
    if (0x00 == ((*picmr2_reg) & RIIC_ICMR2_TMWE))
    {
        /* Do Nothing */
    }
} /* End of function riic_timeout_counter_clear() */
#endif

